programming/php/php.org
#+setupfile: ../../styles/readtheorg.setup
#+title: PHP

* 类型

| 基本类型   | =int= =float= =string= =bool= |
|------------+-------------------------------|
| 复合类型   | =array= =object=              |
|------------+-------------------------------|
| =null=     | 没有赋值的变量                |
|            | 被 =unset()= 的变量           |
|            | 被赋值为 =null= 的变量        |
|------------+-------------------------------|
| =resource= | 外部资源，如数据库连接        |

** 弱类型

PHP 是弱类型（loosely typed）语言，即：变量使用前不需要声明类型，变量使用时根据上下文自动转换（cast）类型。

#+caption: 字符串中的数字在数学表达式中被转换为整数、浮点数。
#+begin_src php
$a = '5';
$b = 6;
$c = $a + $b; // 11
#+end_src

** 字符串

#+caption: 字符串作为字符数组进行读写
#+begin_src php
$s = 'test';
$c = $str[0];
$s[0] = 'n'; 
#+end_src

#+caption: 字符串自增
#+begin_src php
$a = 'A';
echo ++$a; // B
$b = 'A00';
echo ++$b; // A01
#+end_src

*** 引号

| 单引号 | 严格保留字符串的内容           |
|--------+--------------------------------|
| 双引号 | PHP 会试图将变量名替换为变量值 |

- 双引号可以方便地将字符串和变量值连接，避免重复使用连接符和引号。
- 如果已知字符串中没有变量，最好使用单引号，节约搜索可替换变量的时间。

#+caption: 使用大括号将变量名与前后连接的字符隔离开
#+begin_src php
$foo = 'bar';
echo "get{$foo}function()";
#+end_src

** 类型判断

| =is_bool()=     |         |                                  |
| =is_float()=    |         |                                  |
| =is_integer()=  |         |                                  |
| =is_string()=   |         |                                  |
|-----------------+---------+----------------------------------|
| =is_array()=    |         |                                  |
| =is_object()=   |         |                                  |
| =is_resource()= |         |                                  |
|-----------------+---------+----------------------------------|
| =is_null()=     |         |                                  |
|-----------------+---------+----------------------------------|
| =is_scalar()=   | =true=  | =int= =float= =string= =boolean= |
|                 | =false= | =array= =object= =resource=      |
|-----------------+---------+----------------------------------|
| =is_numeric()=  | =true=  | =int= =float=                    |
|                 |         | 二、八、十六进制数               |
|                 |         | 可以解释为以上数的字符串         |

