programming/php/php.html
---
title: "PHP"
---
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>PHP</title>
<!-- 2017-09-15 Fri 21:18 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />

<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/font.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/htmlize.css"/>





</head>
<body>
<div id="content">
<h1 class="title">PHP</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 类型</a>
<ul>
<li><a href="#sec-1-1">1.1. 弱类型</a></li>
<li><a href="#sec-1-2">1.2. 字符串</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. 引号</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. 类型判断</a></li>
<li><a href="#sec-1-4">1.4. 类型转换</a></li>
<li><a href="#sec-1-5">1.5. Callable</a></li>
</ul>
</li>
<li><a href="#sec-2">2. 变量</a>
<ul>
<li><a href="#sec-2-1">2.1. 变量名</a></li>
<li><a href="#sec-2-2">2.2. 传递</a></li>
<li><a href="#sec-2-3">2.3. 作用域</a></li>
<li><a href="#sec-2-4">2.4. 本地变量</a></li>
<li><a href="#sec-2-5">2.5. 静态变量</a></li>
<li><a href="#sec-2-6">2.6. 全局变量</a></li>
<li><a href="#sec-2-7">2.7. 超级全局变量</a>
<ul>
<li><a href="#sec-2-7-1">2.7.1. <code>$_SERVER</code></a></li>
</ul>
</li>
<li><a href="#sec-2-8">2.8. 预定义变量</a></li>
</ul>
</li>
<li><a href="#sec-3">3. 常量</a>
<ul>
<li><a href="#sec-3-1">3.1. 预定义常量</a></li>
<li><a href="#sec-3-2">3.2. Magic 常量</a></li>
</ul>
</li>
<li><a href="#sec-4">4. 运算符</a>
<ul>
<li><a href="#sec-4-1">4.1. 比较</a></li>
<li><a href="#sec-4-2">4.2. <code>instanceof</code></a></li>
</ul>
</li>
<li><a href="#sec-5">5. 语法</a>
<ul>
<li><a href="#sec-5-1">5.1. heredoc</a></li>
</ul>
</li>
<li><a href="#sec-6">6. 函数</a>
<ul>
<li><a href="#sec-6-1">6.1. 类型约束</a>
<ul>
<li><a href="#sec-6-1-1">6.1.1. 类型转换</a></li>
<li><a href="#sec-6-1-2">6.1.2. 严格类型</a></li>
</ul>
</li>
<li><a href="#sec-6-2">6.2. 类型声明</a></li>
<li><a href="#sec-6-3">6.3. 闭包</a>
<ul>
<li><a href="#sec-6-3-1">6.3.1. Attach state</a></li>
</ul>
</li>
<li><a href="#sec-6-4">6.4. 函数式编程</a></li>
<li><a href="#sec-6-5">6.5. 回调函数</a></li>
</ul>
</li>
<li><a href="#sec-7">7. OO</a>
<ul>
<li><a href="#sec-7-1">7.1. 对象</a>
<ul>
<li><a href="#sec-7-1-1">7.1.1. 对象 ID</a></li>
<li><a href="#sec-7-1-2">7.1.2. 打印对象</a></li>
</ul>
</li>
<li><a href="#sec-7-2">7.2. 可见性</a></li>
<li><a href="#sec-7-3">7.3. 属性</a></li>
<li><a href="#sec-7-4">7.4. 常量</a></li>
<li><a href="#sec-7-5">7.5. 静态</a>
<ul>
<li><a href="#sec-7-5-1">7.5.1. 示例</a></li>
<li><a href="#sec-7-5-2">7.5.2. 静态方法</a></li>
</ul>
</li>
<li><a href="#sec-7-6">7.6. 抽象</a>
<ul>
<li><a href="#sec-7-6-1">7.6.1. 抽象方法</a></li>
<li><a href="#sec-7-6-2">7.6.2. 抽象类</a></li>
</ul>
</li>
<li><a href="#sec-7-7">7.7. 接口</a></li>
<li><a href="#sec-7-8">7.8. <code>final</code> 类</a></li>
<li><a href="#sec-7-9">7.9. Trait</a>
<ul>
<li><a href="#sec-7-9-1">7.9.1. 语法</a></li>
<li><a href="#sec-7-9-2">7.9.2. <code>as</code></a></li>
<li><a href="#sec-7-9-3">7.9.3. <code>insteadof</code></a></li>
<li><a href="#sec-7-9-4">7.9.4. 静态方法</a></li>
<li><a href="#sec-7-9-5">7.9.5. 抽象方法</a></li>
<li><a href="#sec-7-9-6">7.9.6. 示例</a></li>
</ul>
</li>
<li><a href="#sec-7-10">7.10. <code>::</code> 运算符</a>
<ul>
<li><a href="#sec-7-10-1">7.10.1. <code>parent</code></a></li>
<li><a href="#sec-7-10-2">7.10.2. <code>self</code></a></li>
<li><a href="#sec-7-10-3">7.10.3. <code>static</code></a></li>
<li><a href="#sec-7-10-4">7.10.4. <code>class</code></a></li>
</ul>
</li>
<li><a href="#sec-7-11">7.11. <code>clone</code></a></li>
</ul>
</li>
<li><a href="#sec-8">8. 错误</a>
<ul>
<li><a href="#sec-8-1">8.1. 错误等级</a></li>
<li><a href="#sec-8-2">8.2. 配置</a></li>
<li><a href="#sec-8-3">8.3. <code>@</code></a></li>
<li><a href="#sec-8-4">8.4. <code>Error</code> 类</a></li>
</ul>
</li>
<li><a href="#sec-9">9. 异常</a>
<ul>
<li><a href="#sec-9-1">9.1. 自定义异常</a></li>
</ul>
</li>
<li><a href="#sec-10">10. 配置</a>
<ul>
<li><a href="#sec-10-1">10.1. 可设定范围</a></li>
<li><a href="#sec-10-2">10.2. 错误处理</a></li>
<li><a href="#sec-10-3">10.3. 文件上传</a></li>
<li><a href="#sec-10-4">10.4. 路径和目录</a></li>
<li><a href="#sec-10-5">10.5. 安全模式</a></li>
<li><a href="#sec-10-6">10.6. 扩展控制</a></li>
</ul>
</li>
<li><a href="#sec-11">11. 环境</a>
<ul>
<li><a href="#sec-11-1">11.1. 环境变量</a></li>
</ul>
</li>
<li><a href="#sec-12">12. 高级</a>
<ul>
<li><a href="#sec-12-1">12.1. 命名空间</a>
<ul>
<li><a href="#sec-12-1-1">12.1.1. 声明</a></li>
<li><a href="#sec-12-1-2">12.1.2. 引用</a></li>
<li><a href="#sec-12-1-3">12.1.3. 全局命名空间</a></li>
<li><a href="#sec-12-1-4">12.1.4. 规范</a></li>
</ul>
</li>
<li><a href="#sec-12-2">12.2. 生成器</a>
<ul>
<li><a href="#sec-12-2-1">12.2.1. Compare with standard iterator</a></li>
<li><a href="#sec-12-2-2">12.2.2. CSV generator example</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-13">13. 框架</a></li>
<li><a href="#sec-14">14. 命令</a>
<ul>
<li><a href="#sec-14-1">14.1. <code>php</code></a>
<ul>
<li><a href="#sec-14-1-1">14.1.1. 参数</a></li>
<li><a href="#sec-14-1-2">14.1.2. 执行代码</a></li>
<li><a href="#sec-14-1-3">14.1.3. 内置服务器</a></li>
<li><a href="#sec-14-1-4">14.1.4. Router script</a></li>
<li><a href="#sec-14-1-5">14.1.5. CGI</a></li>
<li><a href="#sec-14-1-6">14.1.6. 进程</a></li>
</ul>
</li>
<li><a href="#sec-14-2">14.2. <code>phpenmod</code> <code>phpdismod</code></a></li>
</ul>
</li>
<li><a href="#sec-15">15. 链接</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 类型</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">基本类型</th>
<th scope="col" class="left"><code>int</code> <code>float</code> <code>string</code> <code>bool</code></th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">复合类型</td>
<td class="left"><code>array</code> <code>object</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>null</code></td>
<td class="left">没有赋值的变量</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">被 <code>unset()</code> 的变量</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">被赋值为 <code>null</code> 的变量</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>resource</code></td>
<td class="left">外部资源，如数据库连接</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 弱类型</h3>
<div class="outline-text-3" id="text-1-1">
<p>
PHP 是弱类型（loosely typed）语言，即：变量使用前不需要声明类型，变量使用时根据上下文自动转换（cast）类型。
</p>

<div class="org-src-container">
<label class="org-src-name">字符串中的数字在数学表达式中被转换为整数、浮点数。</label>
<pre class="src src-php">$<span class="org-variable-name">a</span> = <span class="org-string">'5'</span>;
$<span class="org-variable-name">b</span> = <span class="org-default">6</span>;
$<span class="org-variable-name">c</span> = $<span class="org-variable-name">a</span> + $<span class="org-variable-name">b</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">11</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 字符串</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<label class="org-src-name">字符串作为字符数组进行读写</label>
<pre class="src src-php">$<span class="org-variable-name">s</span> = <span class="org-string">'test'</span>;
$<span class="org-variable-name">c</span> = $<span class="org-variable-name">str</span>[<span class="org-default">0</span>];
$<span class="org-variable-name">s</span>[<span class="org-default">0</span>] = <span class="org-string">'n'</span>;
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">字符串自增</label>
<pre class="src src-php">$<span class="org-variable-name">a</span> = <span class="org-string">'A'</span>;
<span class="org-keyword">echo</span> ++$<span class="org-variable-name">a</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">B</span>
$<span class="org-variable-name">b</span> = <span class="org-string">'A00'</span>;
<span class="org-keyword">echo</span> ++$<span class="org-variable-name">b</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">A01</span>
</pre>
</div>
</div>

<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> 引号</h4>
<div class="outline-text-4" id="text-1-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">单引号</th>
<th scope="col" class="left">严格保留字符串的内容</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">双引号</td>
<td class="left">PHP 会试图将变量名替换为变量值</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>双引号可以方便地将字符串和变量值连接，避免重复使用连接符和引号。
</li>
<li>如果已知字符串中没有变量，最好使用单引号，节约搜索可替换变量的时间。
</li>
</ul>

<div class="org-src-container">
<label class="org-src-name">使用大括号将变量名与前后连接的字符隔离开</label>
<pre class="src src-php">$<span class="org-variable-name">foo</span> = <span class="org-string">'bar'</span>;
<span class="org-keyword">echo</span> <span class="org-string">"get{$foo}function()"</span>;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 类型判断</h3>
<div class="outline-text-3" id="text-1-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><code>is_bool()</code></th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
</tr>

<tr>
<th scope="col" class="left"><code>is_float()</code></th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
</tr>

<tr>
<th scope="col" class="left"><code>is_integer()</code></th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
</tr>

<tr>
<th scope="col" class="left"><code>is_string()</code></th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>is_array()</code></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><code>is_object()</code></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><code>is_resource()</code></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>is_null()</code></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>is_scalar()</code></td>
<td class="left"><code>true</code></td>
<td class="left"><code>int</code> <code>float</code> <code>string</code> <code>boolean</code></td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>false</code></td>
<td class="left"><code>array</code> <code>object</code> <code>resource</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>is_numeric()</code></td>
<td class="left"><code>true</code></td>
<td class="left"><code>int</code> <code>float</code></td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">二、八、十六进制数</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">可以解释为以上数的字符串</td>
</tr>
</tbody>
</table>
</div>
</div>
