programming/php/php.org
** 类型转换

|             | 规则                                                                                |
|-------------+-------------------------------------------------------------------------------------|
| =(<type>)=  |                                                                                     |
|-------------+-------------------------------------------------------------------------------------|
| =intval()=  | 空数组转换为 0，非空数组转换为 1。                                                  |
|             | 不以数字开头的字符串转换为 0。                                                      |
|-------------+-------------------------------------------------------------------------------------|
| =boolval()= | =0= =0.0= @@html:<code>""</code>@@ @@html:<code>"0"</code>@@ =[]= 转换为 =false= 。 |
|-------------+-------------------------------------------------------------------------------------|
| =strval()=  |                                                                                     |

** Callable

| =string= | 函数名，原生或自定义                      |
|----------+-------------------------------------------|
| =array=  | 类名、方法名， =array(<class>, <method>)= |

#+caption: 普通函数
#+begin_src php
function foo() {}
call_user_func('foo');
#+end_src

#+caption: 类函数
#+begin_src php
class Foo {
    public static function bar() {}
}

$foo = new Foo();
call_user_func('Foo::bar');
call_user_func(['Foo', 'bar']);
call_user_func([new Foo(), 'bar']);
call_user_func([$foo, 'bar']);
#+end_src

#+caption: 子类函数
#+begin_src php
class A {
    public static function who() {}
}
class B extends A {
    public static function who() {}
}
call_user_func(['B', 'parent::who']);
#+end_src

* 变量

|           |              | 声明     | 可见性                               |
|-----------+--------------+----------+--------------------------------------|
| =$var=    | 本地变量     |          | 函数内声明，只在函数内部有效         |
|           | 静态变量     | =static= | 函数外声明，只在（所有）函数外部有效 |
|-----------+--------------+----------+--------------------------------------|
| =$VAR=    | 全局变量     | =global= | 代码任意位置有效                     |
|-----------+--------------+----------+--------------------------------------|
| =$_VAR=   | 超级全局变量 | 预定义   | 代码任意位置有效                     |
|-----------+--------------+----------+--------------------------------------|
| =VAR=     | 常量         |          |                                      |
|-----------+--------------+----------+--------------------------------------|
| =__VAR__= | 预定义常量   |          |                                      |

** 变量名

- 字母、下划线开头。
- 包含字母、数字、下划线。
- 大小写敏感。

** 传递

|          | *传值*           | *传引用*             |
|----------+------------------+----------------------|
| 函数参数 | 默认             | 签名中的参数前加 =&= |
|----------+------------------+----------------------|
| 变量赋值 | 默认             | 等式右边变量前加 =&= |
|----------+------------------+----------------------|
| 数组赋值 | 始终传值（复制） |                      |
|----------+------------------+----------------------|
| 对象赋值 | PHP 5 之前       | PHP 5 之后           |

需要函数内的变化影响到输入的变量时，可以使用[[global_variable][全局变量]]。

** 作用域

在函数内定义的变量为本地变量，在所有函数外定义的变量为全局变量。

代码不能读取比当前作用域更「本地」的变量，比如在函数内可以读取全局变量，但函数外不能读取函数内的本地变量。

** 本地变量

变量在声明时默认为本地变量。函数内的本地变量，包括函数内声明的变量和输入参数。

** 静态变量

普通的本地变量在函数结束时会清空，要在函数结束后保留变量的值，需要声明为静态变量。

#+begin_src php
function incr() {
	static $count = 0; // 非首次调用函数时，声明会被忽略
	$count++;
    echo $count;
}
incr(); // 1
incr(); // 2
#+end_src

#+caption: 静态变量不能用表达式为静态变量赋值，只能用确定的值。
#+begin_src php
static $int = 1 + 2;     // 错误
static $int = sqrt(144); // 错误
#+end_src

** 全局变量
<<global_variable>>

全局变量是 =$GLOBALS= 数组中的元素，可以直接通过 =$GLOBALS['<NAME>']= 进行声明、读写。

应避免使用全局变量，代码和数据隔离的程序，更容易维护和 debug。且全局变量在函数内外同名，不是良好的习惯。

#+begin_src php
function bar() {
	global $foo; // 声明引用全局变量
	echo $GLOBALS['foo'] . "\n";
}
$foo = 'global variable'; // 声明全局变量
bar();
#+end_src

