programming/php/php.html
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 类型转换</h3>
<div class="outline-text-3" id="text-1-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">规则</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>(&lt;type&gt;)</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>intval()</code></td>
<td class="left">空数组转换为 0，非空数组转换为 1。</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">不以数字开头的字符串转换为 0。</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>boolval()</code></td>
<td class="left"><code>0</code> <code>0.0</code> <code>""</code> <code>"0"</code> <code>[]</code> 转换为 <code>false</code> 。</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>strval()</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Callable</h3>
<div class="outline-text-3" id="text-1-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><code>string</code></th>
<th scope="col" class="left">函数名，原生或自定义</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>array</code></td>
<td class="left">类名、方法名， <code>array(&lt;class&gt;, &lt;method&gt;)</code></td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<label class="org-src-name">普通函数</label>
<pre class="src src-php"><span class="org-keyword">function</span> <span class="org-function-name">foo</span>() {}
<span class="org-function-name">call_user_func</span>(<span class="org-string">'foo'</span>);
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">类函数</label>
<pre class="src src-php"><span class="org-keyword">class</span> <span class="org-type">Foo</span> {
    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-keyword">function</span> <span class="org-function-name">bar</span>() {}
}

$<span class="org-variable-name">foo</span> = <span class="org-keyword">new</span> <span class="org-type">Foo</span>();
<span class="org-function-name">call_user_func</span>(<span class="org-string">'Foo::bar'</span>);
<span class="org-function-name">call_user_func</span>([<span class="org-string">'Foo'</span>, <span class="org-string">'bar'</span>]);
<span class="org-function-name">call_user_func</span>([<span class="org-keyword">new</span> <span class="org-type">Foo</span>(), <span class="org-string">'bar'</span>]);
<span class="org-function-name">call_user_func</span>([$<span class="org-variable-name">foo</span>, <span class="org-string">'bar'</span>]);
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">子类函数</label>
<pre class="src src-php"><span class="org-keyword">class</span> <span class="org-constant">A</span> {
    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-keyword">function</span> <span class="org-function-name">who</span>() {}
}
<span class="org-keyword">class</span> <span class="org-constant">B</span> <span class="org-keyword">extends</span> <span class="org-constant">A</span> {
    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-keyword">function</span> <span class="org-function-name">who</span>() {}
}
<span class="org-function-name">call_user_func</span>([<span class="org-string">'B'</span>, <span class="org-string">'parent::who'</span>]);
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 变量</h2>
<div class="outline-text-2" id="text-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">声明</th>
<th scope="col" class="left">可见性</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>$var</code></td>
<td class="left">本地变量</td>
<td class="left">&#xa0;</td>
<td class="left">函数内声明，只在函数内部有效</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">静态变量</td>
<td class="left"><code>static</code></td>
<td class="left">函数外声明，只在（所有）函数外部有效</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>$VAR</code></td>
<td class="left">全局变量</td>
<td class="left"><code>global</code></td>
<td class="left">代码任意位置有效</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>$_VAR</code></td>
<td class="left">超级全局变量</td>
<td class="left">预定义</td>
<td class="left">代码任意位置有效</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>VAR</code></td>
<td class="left">常量</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>__VAR__</code></td>
<td class="left">预定义常量</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 变量名</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>字母、下划线开头。
</li>
<li>包含字母、数字、下划线。
</li>
<li>大小写敏感。
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 传递</h3>
<div class="outline-text-3" id="text-2-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left"><b>传值</b></th>
<th scope="col" class="left"><b>传引用</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">函数参数</td>
<td class="left">默认</td>
<td class="left">签名中的参数前加 <code>&amp;</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">变量赋值</td>
<td class="left">默认</td>
<td class="left">等式右边变量前加 <code>&amp;</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">数组赋值</td>
<td class="left">始终传值（复制）</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">对象赋值</td>
<td class="left">PHP 5 之前</td>
<td class="left">PHP 5 之后</td>
</tr>
</tbody>
</table>

<p>
需要函数内的变化影响到输入的变量时，可以使用<a href="#global_variable">全局变量</a>。
</p>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 作用域</h3>
<div class="outline-text-3" id="text-2-3">
<p>
在函数内定义的变量为本地变量，在所有函数外定义的变量为全局变量。
</p>

<p>
代码不能读取比当前作用域更「本地」的变量，比如在函数内可以读取全局变量，但函数外不能读取函数内的本地变量。
</p>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 本地变量</h3>
<div class="outline-text-3" id="text-2-4">
<p>
变量在声明时默认为本地变量。函数内的本地变量，包括函数内声明的变量和输入参数。
</p>
</div>
</div>
<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> 静态变量</h3>
<div class="outline-text-3" id="text-2-5">
<p>
普通的本地变量在函数结束时会清空，要在函数结束后保留变量的值，需要声明为静态变量。
</p>

<div class="org-src-container">

<pre class="src src-php"><span class="org-keyword">function</span> <span class="org-function-name">incr</span>() {
    <span class="org-keyword">static</span> $<span class="org-variable-name">count</span> = <span class="org-default">0</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">&#38750;&#39318;&#27425;&#35843;&#29992;&#20989;&#25968;&#26102;&#65292;&#22768;&#26126;&#20250;&#34987;&#24573;&#30053;</span>
    $<span class="org-variable-name">count</span>++;
    <span class="org-keyword">echo</span> $<span class="org-variable-name">count</span>;
}
<span class="org-function-name">incr</span>(); <span class="org-comment-delimiter">// </span><span class="org-comment">1</span>
<span class="org-function-name">incr</span>(); <span class="org-comment-delimiter">// </span><span class="org-comment">2</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">静态变量不能用表达式为静态变量赋值，只能用确定的值。</label>
<pre class="src src-php"><span class="org-keyword">static</span> $<span class="org-variable-name">int</span> = <span class="org-default">1</span> + <span class="org-default">2</span>;     <span class="org-comment-delimiter">// </span><span class="org-comment">&#38169;&#35823;</span>
<span class="org-keyword">static</span> $<span class="org-variable-name">int</span> = <span class="org-function-name">sqrt</span>(<span class="org-default">144</span>); <span class="org-comment-delimiter">// </span><span class="org-comment">&#38169;&#35823;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> 全局变量</h3>
<div class="outline-text-3" id="text-2-6">
<p>
<a id="global_variable" name="global_variable"></a>
</p>

<p>
全局变量是 <code>$GLOBALS</code> 数组中的元素，可以直接通过 <code>$GLOBALS['&lt;NAME&gt;']</code> 进行声明、读写。
</p>

<p>
应避免使用全局变量，代码和数据隔离的程序，更容易维护和 debug。且全局变量在函数内外同名，不是良好的习惯。
</p>

<div class="org-src-container">

<pre class="src src-php"><span class="org-keyword">function</span> <span class="org-function-name">bar</span>() {
    <span class="org-keyword">global</span> $<span class="org-variable-name">foo</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">&#22768;&#26126;&#24341;&#29992;&#20840;&#23616;&#21464;&#37327;</span>
    <span class="org-keyword">echo</span> $<span class="org-constant">GLOBALS</span>[<span class="org-string">'foo'</span>] . <span class="org-string">"\n"</span>;
}
$<span class="org-variable-name">foo</span> = <span class="org-string">'global variable'</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">&#22768;&#26126;&#20840;&#23616;&#21464;&#37327;</span>
<span class="org-function-name">bar</span>();
</pre>
</div>
</div>
</div>
