programming/php/php.org
** 超级全局变量

PHP 预定义的全局变量。

| =$GLOBALS=  | 保存当前所有全局变量，键为全局变量名               |
|-------------+----------------------------------------------------|
| =$_SERVER=  | 由服务器创建，包含服务器和执行环境的信息           |
|-------------+----------------------------------------------------|
| =$_GET=     | 通过 GET 方法传递的变量                            |
|-------------+----------------------------------------------------|
| =$_POST=    | 通过 POST 方法传递的变量                           |
|-------------+----------------------------------------------------|
| =$_FILES=   | 通过 POST 方法上传的文件                           |
|-------------+----------------------------------------------------|
| =$_COOKIE=  | 通过 cookie 传递的变量                             |
|-------------+----------------------------------------------------|
| =$_SESSION= | 当前代码中可用的 session 变量                      |
|-------------+----------------------------------------------------|
| =$_REQUEST= | 浏览器传递的内容，包括 =$_GET= =$_POST= =$_COOKIE= |
|-------------+----------------------------------------------------|
| =$_ENV=     | 通过 =environment= 方法传递的变量                  |

#+caption: 为避免通过 =$_GET= 和 =$_POST= 向服务器发送恶意代码，使用前需要转义
#+begin_src php
$came_from = htmlentities($_SERVER['HTTP_REFERER']);
#+end_src

