programming/php/php.html
<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> 超级全局变量</h3>
<div class="outline-text-3" id="text-2-7">
<p>
PHP 预定义的全局变量。
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><code>$GLOBALS</code></th>
<th scope="col" class="left">保存当前所有全局变量，键为全局变量名</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>$_SERVER</code></td>
<td class="left">由服务器创建，包含服务器和执行环境的信息</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>$_GET</code></td>
<td class="left">通过 GET 方法传递的变量</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>$_POST</code></td>
<td class="left">通过 POST 方法传递的变量</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>$_FILES</code></td>
<td class="left">通过 POST 方法上传的文件</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>$_COOKIE</code></td>
<td class="left">通过 cookie 传递的变量</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>$_SESSION</code></td>
<td class="left">当前代码中可用的 session 变量</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>$_REQUEST</code></td>
<td class="left">浏览器传递的内容，包括 <code>$_GET</code> <code>$_POST</code> <code>$_COOKIE</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>$_ENV</code></td>
<td class="left">通过 <code>environment</code> 方法传递的变量</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<label class="org-src-name">为避免通过 <code>$_GET</code> 和 <code>$_POST</code> 向服务器发送恶意代码，使用前需要转义</label>
<pre class="src src-php">$<span class="org-variable-name">came_from</span> = <span class="org-function-name">htmlentities</span>($<span class="org-constant">_SERVER</span>[<span class="org-string">'HTTP_REFERER'</span>]);
</pre>
</div>
</div>
