programming/php/php.org
*** =$_SERVER=

| *客户端*      | =REMOTE_ADDR=            | 客户端 IP 地址                        | =::ffff:10.245.205.147=                                           |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
|               | =REMOTE_PORT=            | 客户端端口号                          | =49718=                                                           |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
|               | =REMOTE_HOST=            | 客户端主机名，DNS 反向查找            |                                                                   |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
| *请求*        | =REQUEST_URI=            | 请求 URI                              | =/render.php=                                                     |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
|               | =QUERY_STRING=           | 请求参数                              |                                                                   |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
|               | =REQUEST_METHOD=         | 请求方法                              | =POST=                                                            |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
|               | =CONTENT_LENGTH=         |                                       | =72=                                                              |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
|               | =CONTENT_TYPE=           |                                       | =application/x-www-form-urlencoded=                               |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
|               | =HTTP_COOKIE=            |                                       | =__utmt=1; __utma=165884987; ...=                                 |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
|               | =HTTPS=                  | 请求是否使用 HTTPS 协议               |                                                                   |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
| *请求 header* | =HTTP_HOST=              | =Host=                                | =www.tehplayground.com=                                           |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
|               | =HTTP_REFERER=           | 转向当前页面之前的页面地址（不可信）  | =http://www.tehplayground.com/=                                   |
|               |                          | 若直接输入地址到浏览器，则为空字符串  |                                                                   |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
|               | =HTTP_USER_AGENT=        | =User-Agent=                          | =Mozilla/5.0 (Windows NT 6.1; WOW64) ...=                         |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
|               | =HTTP_CONNECTION=        | =Connection=                          | =Keep-Alive=                                                      |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
|               | =HTTP_CONTENT_LENGTH=    |                                       | =72=                                                              |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
|               | =HTTP_ACCEPT=            | =Accept=                              |                                                                   |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
|               | =HTTP_ACCEPT_CHARSET=    | =Accept-Charset=                      | =iso-8859-1,*,utf-8=                                              |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
|               | =HTTP_ACCEPT_ENCODING=   | =Accept-Encoding=                     | =gzip=                                                            |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
|               | =HTTP_ACCEPT_LANGUAGE=   | =Accept-Language=                     | =en-US,en;q=0.8=                                                  |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
|               | =HTTP_X_FORWARDED_FOR=   |                                       | =129.173.43.60=                                                   |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
|               | =HTTP_X_FORWARDED_PROTO= |                                       | =http=                                                            |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
| *服务器端*    | =SERVER_NAME=            | 服务器主机名，或虚拟主机名            | =www.tehplayground.com=                                           |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
|               | =SERVER_ADDR=            | 服务器 IP 地址                        | =::ffff:10.245.205.147=                                           |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
|               | =SERVER_PORT=            | 服务器端口号                          | =80=                                                              |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
|               | =SERVER_SOFTWARE=        | 服务器软件、版本号                    | =lighttpd/1.4.31=                                                 |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
|               | =SERVER_PROTOCOL=        | 请求的协议、版本号                    | =HTTP/1.1=                                                        |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
|               | =GATEWAY_INTERFACE=      | 服务器使用的 CGI 规范版本号           | =CGI/1.1=                                                         |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
| *身份验证*    | =AUTH_TYPE=              |                                       |                                                                   |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
|               | =PHP_AUTH_USER=          | HTTP 验证时用户输入的用户名           |                                                                   |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
|               | =PHP_AUTH_PW=            | HTTP 验证时用户输入的密码             |                                                                   |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
|               | =REMOTE_USER=            | 验证用户                              |                                                                   |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
| *执行脚本*    | =DOCUMENT_ROOT=          | 根目录（服务器配置文件中定义）        | =/var/www/=                                                       |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
|               | =PHP_SELF=               | 当前脚本相对路径                      | =/render.php=                                                     |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
|               | =SCRIPT_NAME=            | 当前脚本路径                          | =/render.php=                                                     |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
|               | =SCRIPT_FILENAME=        | 当前脚本绝对路径                      | =/var/www/render.php=                                             |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
|               | =REQUEST_TIME=           | 请求时间戳                            | =1456329981=                                                      |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
|               | =REQUEST_TIME_FLOAT=     | 请求时间戳，精确到毫秒                |                                                                   |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
| *执行环境*    | =PATH=                   |                                       | =/sbin:/usr/sbin:/bin:/usr/bin=                                   |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
|               | =PATH_INFO=              | URL 中脚本名之后、请求参数之前的部分  | =/some/stuff= （ =http://foo.com/index.php/some/stuff?foo=bar= ） |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
| *命令行*      | =argv=                   | 命令行参数数组，或 GET 请求的参数数组 |                                                                   |
|---------------+--------------------------+---------------------------------------+-------------------------------------------------------------------|
|               | =argc=                   | 命令行参数个数                        |                                                                   |

