programming/php/php.html

<div id="outline-container-sec-2-7-1" class="outline-4">
<h4 id="sec-2-7-1"><span class="section-number-4">2.7.1</span> <code>$_SERVER</code></h4>
<div class="outline-text-4" id="text-2-7-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><b>客户端</b></th>
<th scope="col" class="left"><code>REMOTE_ADDR</code></th>
<th scope="col" class="left">客户端 IP 地址</th>
<th scope="col" class="left"><code>::ffff:10.245.205.147</code></th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>REMOTE_PORT</code></td>
<td class="left">客户端端口号</td>
<td class="left"><code>49718</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>REMOTE_HOST</code></td>
<td class="left">客户端主机名，DNS 反向查找</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><b>请求</b></td>
<td class="left"><code>REQUEST_URI</code></td>
<td class="left">请求 URI</td>
<td class="left"><code>/render.php</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>QUERY_STRING</code></td>
<td class="left">请求参数</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>REQUEST_METHOD</code></td>
<td class="left">请求方法</td>
<td class="left"><code>POST</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>CONTENT_LENGTH</code></td>
<td class="left">&#xa0;</td>
<td class="left"><code>72</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>CONTENT_TYPE</code></td>
<td class="left">&#xa0;</td>
<td class="left"><code>application/x-www-form-urlencoded</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>HTTP_COOKIE</code></td>
<td class="left">&#xa0;</td>
<td class="left"><code>__utmt=1; __utma=165884987; ...</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>HTTPS</code></td>
<td class="left">请求是否使用 HTTPS 协议</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><b>请求 header</b></td>
<td class="left"><code>HTTP_HOST</code></td>
<td class="left"><code>Host</code></td>
<td class="left"><code>www.tehplayground.com</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>HTTP_REFERER</code></td>
<td class="left">转向当前页面之前的页面地址（不可信）</td>
<td class="left"><code>http://www.tehplayground.com/</code></td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">若直接输入地址到浏览器，则为空字符串</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>HTTP_USER_AGENT</code></td>
<td class="left"><code>User-Agent</code></td>
<td class="left"><code>Mozilla/5.0 (Windows NT 6.1; WOW64) ...</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>HTTP_CONNECTION</code></td>
<td class="left"><code>Connection</code></td>
<td class="left"><code>Keep-Alive</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>HTTP_CONTENT_LENGTH</code></td>
<td class="left">&#xa0;</td>
<td class="left"><code>72</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>HTTP_ACCEPT</code></td>
<td class="left"><code>Accept</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>HTTP_ACCEPT_CHARSET</code></td>
<td class="left"><code>Accept-Charset</code></td>
<td class="left"><code>iso-8859-1,*,utf-8</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>HTTP_ACCEPT_ENCODING</code></td>
<td class="left"><code>Accept-Encoding</code></td>
<td class="left"><code>gzip</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>HTTP_ACCEPT_LANGUAGE</code></td>
<td class="left"><code>Accept-Language</code></td>
<td class="left"><code>en-US,en;q=0.8</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>HTTP_X_FORWARDED_FOR</code></td>
<td class="left">&#xa0;</td>
<td class="left"><code>129.173.43.60</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>HTTP_X_FORWARDED_PROTO</code></td>
<td class="left">&#xa0;</td>
<td class="left"><code>http</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><b>服务器端</b></td>
<td class="left"><code>SERVER_NAME</code></td>
<td class="left">服务器主机名，或虚拟主机名</td>
<td class="left"><code>www.tehplayground.com</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>SERVER_ADDR</code></td>
<td class="left">服务器 IP 地址</td>
<td class="left"><code>::ffff:10.245.205.147</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>SERVER_PORT</code></td>
<td class="left">服务器端口号</td>
<td class="left"><code>80</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>SERVER_SOFTWARE</code></td>
<td class="left">服务器软件、版本号</td>
<td class="left"><code>lighttpd/1.4.31</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>SERVER_PROTOCOL</code></td>
<td class="left">请求的协议、版本号</td>
<td class="left"><code>HTTP/1.1</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>GATEWAY_INTERFACE</code></td>
<td class="left">服务器使用的 CGI 规范版本号</td>
<td class="left"><code>CGI/1.1</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><b>身份验证</b></td>
<td class="left"><code>AUTH_TYPE</code></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>PHP_AUTH_USER</code></td>
<td class="left">HTTP 验证时用户输入的用户名</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>PHP_AUTH_PW</code></td>
<td class="left">HTTP 验证时用户输入的密码</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>REMOTE_USER</code></td>
<td class="left">验证用户</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><b>执行脚本</b></td>
<td class="left"><code>DOCUMENT_ROOT</code></td>
<td class="left">根目录（服务器配置文件中定义）</td>
<td class="left"><code>/var/www/</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>PHP_SELF</code></td>
<td class="left">当前脚本相对路径</td>
<td class="left"><code>/render.php</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>SCRIPT_NAME</code></td>
<td class="left">当前脚本路径</td>
<td class="left"><code>/render.php</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>SCRIPT_FILENAME</code></td>
<td class="left">当前脚本绝对路径</td>
<td class="left"><code>/var/www/render.php</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>REQUEST_TIME</code></td>
<td class="left">请求时间戳</td>
<td class="left"><code>1456329981</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>REQUEST_TIME_FLOAT</code></td>
<td class="left">请求时间戳，精确到毫秒</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><b>执行环境</b></td>
<td class="left"><code>PATH</code></td>
<td class="left">&#xa0;</td>
<td class="left"><code>/sbin:/usr/sbin:/bin:/usr/bin</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>PATH_INFO</code></td>
<td class="left">URL 中脚本名之后、请求参数之前的部分</td>
<td class="left"><code>/some/stuff</code> （ <code>http://foo.com/index.php/some/stuff?foo=bar</code> ）</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><b>命令行</b></td>
<td class="left"><code>argv</code></td>
<td class="left">命令行参数数组，或 GET 请求的参数数组</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>argc</code></td>
<td class="left">命令行参数个数</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
