programming/php/php.org
** 预定义变量

| =$argc=                 | 从命令行传递的参数个数 |
|-------------------------+------------------------|
| =$argv=                 | 从命令行传递的参数数组 |
|-------------------------+------------------------|
| =$php_errormsg=         |                        |
|-------------------------+------------------------|
| =$HTTP_RAW_POST_DATA=   |                        |
|-------------------------+------------------------|
| =$http_response_header= |                        |

* 常量

常量定义之后，在程序运行的过程中值不会改变。

常量名不能加 =$= 前缀，通常用大写字母命名。

#+caption: 示例
#+begin_src php
define('ROOT_LOCATION', '/usr/local/www/'); // 定义
$directory = ROOT_LOCATION;                 // 引用
#+end_src

** 预定义常量

| =PHP_VERSION= |   |
|---------------+---|
|               |   |

** Magic 常量

| =__LINE__=      | 当前文件的当前行数                         |
|-----------------+--------------------------------------------|
| =__FUNCTION__=  | 当前函数名                                 |
|-----------------+--------------------------------------------|
| =__METHOD__=    | 当前类方法名                               |
|-----------------+--------------------------------------------|
| =__CLASS__=     | 当前类名                                   |
|-----------------+--------------------------------------------|
| =__FILE__=      | 当前文件的绝对路径和文件名                 |
|-----------------+--------------------------------------------|
| =__DIR__=       | 当前文件的目录名，等于 =dirname(__FILE__)= |
|-----------------+--------------------------------------------|
| =__NAMESPACE__= | 当前命名空间                               |

* 运算符
** 比较

| @@html:<code>==</code>@@  | 比较值       | 进行隐性类型转换，会混淆零值 =0= =false= =null= |
|---------------------------+--------------+-------------------------------------------------|
| @@html:<code>===</code>@@ | 比较值和类型 | 无隐式类型转换                                  |

#+begin_src php
$result = strpos($haystack, $needle);
if ($result == false) {}  // 错误，返回值为 0 时条件也成立
if ($result === false) {} // 正确
#+end_src

#+caption: 数组比较
| @@html:<code>==</code>@@  | 比较键值（即排序后完全一致） |
|---------------------------+------------------------------|
| @@html:<code>===</code>@@ | 比较键值和顺序               |

** =instanceof=

判断对象是否属于指定类型。

#+caption: 子类的对象属于基类的类型。
#+begin_src php
class Foo {}
class Bar extends Foo {}
$bar = new Bar();
$bar instanceof Foo; // true
$bar instanceof Bar; // true
#+end_src

* 语法
** heredoc

- 保留一段文本中的换行、空格和缩进。
- 可以输出整段 HTML，但浏览器会按自己的方式处理换行（显示为空格）。

#+caption: 示例
#+begin_src php
$author = "Alfred E Newman";
echo <<<_FOO          // 开头标示符后不能加分号，否则产生解析错误
                      // 标示符可以自定义，但为了不与变量和方法重名，通常使用 _CAPITAL

This is a Headline    // 换行、引号不需要转义，可以使用分号
- Written by $author. // 文本相当于被双引号包装，变量名会被替换

_FOO;                 // 结尾标示符加分号，前后不能加任何内容，包括空格、注释
                      // 前后两个标示符必须对应
#+end_src

* 函数

- 函数名不区分大小写。

