programming/php/php.html
<div id="outline-container-sec-2-8" class="outline-3">
<h3 id="sec-2-8"><span class="section-number-3">2.8</span> 预定义变量</h3>
<div class="outline-text-3" id="text-2-8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><code>$argc</code></th>
<th scope="col" class="left">从命令行传递的参数个数</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>$argv</code></td>
<td class="left">从命令行传递的参数数组</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>$php_errormsg</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>$HTTP_RAW_POST_DATA</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>$http_response_header</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 常量</h2>
<div class="outline-text-2" id="text-3">
<p>
常量定义之后，在程序运行的过程中值不会改变。
</p>

<p>
常量名不能加 <code>$</code> 前缀，通常用大写字母命名。
</p>

<div class="org-src-container">
<label class="org-src-name">示例</label>
<pre class="src src-php"><span class="org-function-name">define</span>(<span class="org-string">'ROOT_LOCATION'</span>, <span class="org-string">'/usr/local/www/'</span>); <span class="org-comment-delimiter">// </span><span class="org-comment">&#23450;&#20041;</span>
$<span class="org-variable-name">directory</span> = <span class="org-constant">ROOT_LOCATION</span>;                 <span class="org-comment-delimiter">// </span><span class="org-comment">&#24341;&#29992;</span>
</pre>
</div>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 预定义常量</h3>
<div class="outline-text-3" id="text-3-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><code>PHP_VERSION</code></th>
<th scope="col" class="left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Magic 常量</h3>
<div class="outline-text-3" id="text-3-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><code>__LINE__</code></th>
<th scope="col" class="left">当前文件的当前行数</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>__FUNCTION__</code></td>
<td class="left">当前函数名</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>__METHOD__</code></td>
<td class="left">当前类方法名</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>__CLASS__</code></td>
<td class="left">当前类名</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>__FILE__</code></td>
<td class="left">当前文件的绝对路径和文件名</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>__DIR__</code></td>
<td class="left">当前文件的目录名，等于 <code>dirname(__FILE__)</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>__NAMESPACE__</code></td>
<td class="left">当前命名空间</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 运算符</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 比较</h3>
<div class="outline-text-3" id="text-4-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><code>==</code></th>
<th scope="col" class="left">比较值</th>
<th scope="col" class="left">进行隐性类型转换，会混淆零值 <code>0</code> <code>false</code> <code>null</code></th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>===</code></td>
<td class="left">比较值和类型</td>
<td class="left">无隐式类型转换</td>
</tr>
</tbody>
</table>

<div class="org-src-container">

<pre class="src src-php">$<span class="org-variable-name">result</span> = <span class="org-function-name">strpos</span>($<span class="org-variable-name">haystack</span>, $<span class="org-variable-name">needle</span>);
<span class="org-keyword">if</span> ($<span class="org-variable-name">result</span> == <span class="org-constant">false</span>) {}  <span class="org-comment-delimiter">// </span><span class="org-comment">&#38169;&#35823;&#65292;&#36820;&#22238;&#20540;&#20026; 0 &#26102;&#26465;&#20214;&#20063;&#25104;&#31435;</span>
<span class="org-keyword">if</span> ($<span class="org-variable-name">result</span> === <span class="org-constant">false</span>) {} <span class="org-comment-delimiter">// </span><span class="org-comment">&#27491;&#30830;</span>
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> 数组比较</caption>

<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><code>==</code></th>
<th scope="col" class="left">比较键值（即排序后完全一致）</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>===</code></td>
<td class="left">比较键值和顺序</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> <code>instanceof</code></h3>
<div class="outline-text-3" id="text-4-2">
<p>
判断对象是否属于指定类型。
</p>

<div class="org-src-container">
<label class="org-src-name">子类的对象属于基类的类型。</label>
<pre class="src src-php"><span class="org-keyword">class</span> <span class="org-type">Foo</span> {}
<span class="org-keyword">class</span> <span class="org-type">Bar</span> <span class="org-keyword">extends</span> <span class="org-type">Foo</span> {}
$<span class="org-variable-name">bar</span> = <span class="org-keyword">new</span> <span class="org-type">Bar</span>();
$<span class="org-variable-name">bar</span> <span class="org-keyword">instanceof</span> <span class="org-type">Foo</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">true</span>
$<span class="org-variable-name">bar</span> <span class="org-keyword">instanceof</span> <span class="org-type">Bar</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">true</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 语法</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> heredoc</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>保留一段文本中的换行、空格和缩进。
</li>
<li>可以输出整段 HTML，但浏览器会按自己的方式处理换行（显示为空格）。
</li>
</ul>

<div class="org-src-container">
<label class="org-src-name">示例</label>
<pre class="src src-php">$<span class="org-variable-name">author</span> = <span class="org-string">"Alfred E Newman"</span>;
<span class="org-keyword">echo</span> &lt;&lt;&lt;<span class="org-warning">_FOO</span>          <span class="org-comment-delimiter">// </span><span class="org-comment">&#24320;&#22836;&#26631;&#31034;&#31526;&#21518;&#19981;&#33021;&#21152;&#20998;&#21495;&#65292;&#21542;&#21017;&#20135;&#29983;&#35299;&#26512;&#38169;&#35823;</span>
                      <span class="org-comment-delimiter">// </span><span class="org-comment">&#26631;&#31034;&#31526;&#21487;&#20197;&#33258;&#23450;&#20041;&#65292;&#20294;&#20026;&#20102;&#19981;&#19982;&#21464;&#37327;&#21644;&#26041;&#27861;&#37325;&#21517;&#65292;&#36890;&#24120;&#20351;&#29992; _CAPITAL</span>

<span class="org-warning">This</span> <span class="org-warning">is</span> <span class="org-warning">a</span> <span class="org-warning">Headline</span>    <span class="org-comment-delimiter">// </span><span class="org-comment">&#25442;&#34892;&#12289;&#24341;&#21495;&#19981;&#38656;&#35201;&#36716;&#20041;&#65292;&#21487;&#20197;&#20351;&#29992;&#20998;&#21495;</span>
- <span class="org-warning">Written</span> <span class="org-warning">by</span> $<span class="org-variable-name">author</span>. <span class="org-comment-delimiter">// </span><span class="org-comment">&#25991;&#26412;&#30456;&#24403;&#20110;&#34987;&#21452;&#24341;&#21495;&#21253;&#35013;&#65292;&#21464;&#37327;&#21517;&#20250;&#34987;&#26367;&#25442;</span>

<span class="org-warning">_FOO</span>;                 <span class="org-comment-delimiter">// </span><span class="org-comment">&#32467;&#23614;&#26631;&#31034;&#31526;&#21152;&#20998;&#21495;&#65292;&#21069;&#21518;&#19981;&#33021;&#21152;&#20219;&#20309;&#20869;&#23481;&#65292;&#21253;&#25324;&#31354;&#26684;&#12289;&#27880;&#37322;</span>
                      <span class="org-comment-delimiter">// </span><span class="org-comment">&#21069;&#21518;&#20004;&#20010;&#26631;&#31034;&#31526;&#24517;&#39035;&#23545;&#24212;</span>
</pre>
</div>
</div>
</div>
</div>
