programming/php/php.org
** 类型约束

类型约束（type hinting）只在运行时（runtime），即函数被调用时检查参数类型。

| *类型*     | *最低版本* |
|------------+------------|
| 类名       |        5.0 |
| 接口名     |            |
| =self=     |            |
|------------+------------|
| =array=    |        5.1 |
|------------+------------|
| =callable= |        5.4 |
|------------+------------|
| =bool=     |        7.0 |
| =float=    |            |
| =int=      |            |
| =string=   |            |

#+begin_src php
class Foo {}
class Bar extends Foo {}

function foo(Foo $arg) {}
function bar(Bar $arg) {}

$foo = new Foo();
$bar = new Bar();

foo($foo); // OK
foo($bar); // OK
bar($foo); // Catchable fatal error (< PHP 7)
           // Fatal error: Uncaught TypeError (hPHP 7)
bar($bar); // OK
#+end_src

*** 类型转换

#+caption: PHP 默认会对标量类型的参数进行必要的类型转换。
#+begin_src php
function foo(float $arg) {}
foo('123'); // OK
foo('abc'); // Fatal error: Uncaught TypeError
#+end_src

*** 严格类型

声明严格类型可以避免隐式类型转换。严格类型声明在客户代码，即函数调用的位置进行，且必须在文件的第一行。

#+begin_src php
// 未声明严格类型
function foo(bool $arg) {
    echo ($arg) ? 'true' : 'false';
}
foo('false'); // true，字符串 false 转换成 bool 为 true

// 声明严格类型
declare(strict_types=1);
function foo(bool $arg) {
    echo ($arg) ? 'true' : 'false';
}
foo('false'); // Fatal error: Uncaught TypeError
#+end_src

** 类型声明

#+begin_src php
function foo(): <type> {
}
#+end_src

|   |   |
|---+---|
|   |   |

** 闭包

闭包（closure）是在在创建时将环境状态（surrounding state）封装（encapsulate）起来的函数，封装的状态一直存在于闭包内部，即使原本的环境已经不存在，即匿名函数可以引用其父作用域中定义的变量。

PHP 的闭包和匿名函数是等价的，匿名函数使用普通函数的语法，但实际是 =Closure= 类的对象。 =Closure= 类实现 =__invoke()= 方法，当变量名后加 =()= 时，PHP 会调用 =__invoke()= 方法。

#+begin_src php
function output($prefix) {
    $count = 10;
    return function(string $text) use ($prefix, $count) {
        while ($count > 0) {
            echo $prefix . $text . "\n";
            $count--;
        }
    };
}
call_user_func(output('Foo: '), 'bar');
#+end_src

#+caption: 闭包修改外部变量的值
#+begin_src php
class Foo {
    public static function add($first) {
        $total = 0;
        return function($second) use ($first, &$total) { // & 传递引用
            $total += $first + $second;
            return $total;
        };
    }
}

$foo = Foo::add(10);
echo $foo(5); // 15 = 10 + 5
echo $foo(6); // 31 = 15 + 10 + 6
#+end_src

