programming/php/php.html
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 函数</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>函数名不区分大小写。
</li>
</ul>
</div>

<div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> 类型约束</h3>
<div class="outline-text-3" id="text-6-1">
<p>
类型约束（type hinting）只在运行时（runtime），即函数被调用时检查参数类型。
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><b>类型</b></th>
<th scope="col" class="right"><b>最低版本</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">类名</td>
<td class="right">5.0</td>
</tr>

<tr>
<td class="left">接口名</td>
<td class="right">&#xa0;</td>
</tr>

<tr>
<td class="left"><code>self</code></td>
<td class="right">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>array</code></td>
<td class="right">5.1</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>callable</code></td>
<td class="right">5.4</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>bool</code></td>
<td class="right">7.0</td>
</tr>

<tr>
<td class="left"><code>float</code></td>
<td class="right">&#xa0;</td>
</tr>

<tr>
<td class="left"><code>int</code></td>
<td class="right">&#xa0;</td>
</tr>

<tr>
<td class="left"><code>string</code></td>
<td class="right">&#xa0;</td>
</tr>
</tbody>
</table>

<div class="org-src-container">

<pre class="src src-php"><span class="org-keyword">class</span> <span class="org-type">Foo</span> {}
<span class="org-keyword">class</span> <span class="org-type">Bar</span> <span class="org-keyword">extends</span> <span class="org-type">Foo</span> {}

<span class="org-keyword">function</span> <span class="org-function-name">foo</span>(<span class="org-type">Foo</span> $<span class="org-variable-name">arg</span>) {}
<span class="org-keyword">function</span> <span class="org-function-name">bar</span>(<span class="org-type">Bar</span> $<span class="org-variable-name">arg</span>) {}

$<span class="org-variable-name">foo</span> = <span class="org-keyword">new</span> <span class="org-type">Foo</span>();
$<span class="org-variable-name">bar</span> = <span class="org-keyword">new</span> <span class="org-type">Bar</span>();

<span class="org-function-name">foo</span>($<span class="org-variable-name">foo</span>); <span class="org-comment-delimiter">// </span><span class="org-comment">OK</span>
<span class="org-function-name">foo</span>($<span class="org-variable-name">bar</span>); <span class="org-comment-delimiter">// </span><span class="org-comment">OK</span>
<span class="org-function-name">bar</span>($<span class="org-variable-name">foo</span>); <span class="org-comment-delimiter">// </span><span class="org-comment">Catchable fatal error (&lt; PHP 7)</span>
           <span class="org-comment-delimiter">// </span><span class="org-comment">Fatal error: Uncaught TypeError (hPHP 7)</span>
<span class="org-function-name">bar</span>($<span class="org-variable-name">bar</span>); <span class="org-comment-delimiter">// </span><span class="org-comment">OK</span>
</pre>
</div>
</div>

<div id="outline-container-sec-6-1-1" class="outline-4">
<h4 id="sec-6-1-1"><span class="section-number-4">6.1.1</span> 类型转换</h4>
<div class="outline-text-4" id="text-6-1-1">
<div class="org-src-container">
<label class="org-src-name">PHP 默认会对标量类型的参数进行必要的类型转换。</label>
<pre class="src src-php"><span class="org-keyword">function</span> <span class="org-function-name">foo</span>(<span class="org-type">float</span> $<span class="org-variable-name">arg</span>) {}
<span class="org-function-name">foo</span>(<span class="org-string">'123'</span>); <span class="org-comment-delimiter">// </span><span class="org-comment">OK</span>
<span class="org-function-name">foo</span>(<span class="org-string">'abc'</span>); <span class="org-comment-delimiter">// </span><span class="org-comment">Fatal error: Uncaught TypeError</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-1-2" class="outline-4">
<h4 id="sec-6-1-2"><span class="section-number-4">6.1.2</span> 严格类型</h4>
<div class="outline-text-4" id="text-6-1-2">
<p>
声明严格类型可以避免隐式类型转换。严格类型声明在客户代码，即函数调用的位置进行，且必须在文件的第一行。
</p>

<div class="org-src-container">

<pre class="src src-php"><span class="org-comment-delimiter">// </span><span class="org-comment">&#26410;&#22768;&#26126;&#20005;&#26684;&#31867;&#22411;</span>
<span class="org-keyword">function</span> <span class="org-function-name">foo</span>(<span class="org-type">bool</span> $<span class="org-variable-name">arg</span>) {
    <span class="org-keyword">echo</span> ($<span class="org-variable-name">arg</span>) ? <span class="org-string">'true'</span> : <span class="org-string">'false'</span>;
}
<span class="org-function-name">foo</span>(<span class="org-string">'false'</span>); <span class="org-comment-delimiter">// </span><span class="org-comment">true&#65292;&#23383;&#31526;&#20018; false &#36716;&#25442;&#25104; bool &#20026; true</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">&#22768;&#26126;&#20005;&#26684;&#31867;&#22411;</span>
<span class="org-keyword">declare</span>(<span class="org-warning">strict_types</span>=<span class="org-default">1</span>);
<span class="org-keyword">function</span> <span class="org-function-name">foo</span>(<span class="org-type">bool</span> $<span class="org-variable-name">arg</span>) {
    <span class="org-keyword">echo</span> ($<span class="org-variable-name">arg</span>) ? <span class="org-string">'true'</span> : <span class="org-string">'false'</span>;
}
<span class="org-function-name">foo</span>(<span class="org-string">'false'</span>); <span class="org-comment-delimiter">// </span><span class="org-comment">Fatal error: Uncaught TypeError</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> 类型声明</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">

<pre class="src src-php"><span class="org-keyword">function</span> <span class="org-function-name">foo</span>(): <span class="org-constant">&lt;type&gt;</span> {
}
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> 闭包</h3>
<div class="outline-text-3" id="text-6-3">
<p>
闭包（closure）是在在创建时将环境状态（surrounding state）封装（encapsulate）起来的函数，封装的状态一直存在于闭包内部，即使原本的环境已经不存在，即匿名函数可以引用其父作用域中定义的变量。
</p>

<p>
PHP 的闭包和匿名函数是等价的，匿名函数使用普通函数的语法，但实际是 <code>Closure</code> 类的对象。 <code>Closure</code> 类实现 <code>__invoke()</code> 方法，当变量名后加 <code>()</code> 时，PHP 会调用 <code>__invoke()</code> 方法。
</p>

<div class="org-src-container">

<pre class="src src-php"><span class="org-keyword">function</span> <span class="org-function-name">output</span>($<span class="org-variable-name">prefix</span>) {
    $<span class="org-variable-name">count</span> = <span class="org-default">10</span>;
    <span class="org-keyword">return</span> <span class="org-keyword">function</span>(<span class="org-type">string</span> $<span class="org-variable-name">text</span>) <span class="org-keyword">use</span> ($<span class="org-variable-name">prefix</span>, $<span class="org-variable-name">count</span>) {
        <span class="org-keyword">while</span> ($<span class="org-variable-name">count</span> &gt; <span class="org-default">0</span>) {
            <span class="org-keyword">echo</span> $<span class="org-variable-name">prefix</span> . $<span class="org-variable-name">text</span> . <span class="org-string">"\n"</span>;
            $<span class="org-variable-name">count</span>--;
        }
    };
}
<span class="org-function-name">call_user_func</span>(<span class="org-function-name">output</span>(<span class="org-string">'Foo: '</span>), <span class="org-string">'bar'</span>);
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">闭包修改外部变量的值</label>
<pre class="src src-php"><span class="org-keyword">class</span> <span class="org-type">Foo</span> {
    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-keyword">function</span> <span class="org-function-name">add</span>($<span class="org-variable-name">first</span>) {
        $<span class="org-variable-name">total</span> = <span class="org-default">0</span>;
        <span class="org-keyword">return</span> <span class="org-keyword">function</span>($<span class="org-variable-name">second</span>) <span class="org-keyword">use</span> ($<span class="org-variable-name">first</span>, &amp;$<span class="org-variable-name">total</span>) { <span class="org-comment-delimiter">// </span><span class="org-comment">&amp; &#20256;&#36882;&#24341;&#29992;</span>
            $<span class="org-variable-name">total</span> += $<span class="org-variable-name">first</span> + $<span class="org-variable-name">second</span>;
            <span class="org-keyword">return</span> $<span class="org-variable-name">total</span>;
        };
    }
}

$<span class="org-variable-name">foo</span> = <span class="org-type">Foo</span>::<span class="org-function-name">add</span>(<span class="org-default">10</span>);
<span class="org-keyword">echo</span> <span class="org-function-name">$foo</span>(<span class="org-default">5</span>); <span class="org-comment-delimiter">// </span><span class="org-comment">15 = 10 + 5</span>
<span class="org-keyword">echo</span> <span class="org-function-name">$foo</span>(<span class="org-default">6</span>); <span class="org-comment-delimiter">// </span><span class="org-comment">31 = 15 + 10 + 6</span>
</pre>
</div>
</div>
