programming/php/php.org
*** Attach state

Attach state
- with the closure object’s =bindTo()= method or the =use= keyword
- attached variable retains the value assigned to it at the time it is attached

=use= example
#+begin_src php
<?php
function enclosePerson($name) {
    return function ($doCommand) use ($name) { // attach multiple variables with ,
        return sprintf('%s, %s', $name, $doCommand);
    };
}
$clay = enclosePerson('Clay');
echo $clay('get me sweet tea!');
// Outputs --> "Clay, get me sweet tea!"
#+end_src

=bindTo()=
- can bind a =Closure= object’s internal state to a different object
- accept a second argument that specifies the PHP class of the object to which the closure is bound
- let the closure access protected and private member variables of the object to which it is bound

=bindTo()= example
#+begin_src php
<?php
class App
{
    protected $routes = array();
    protected $responseStatus = '200 OK';
    protected $responseContentType = 'text/html';
    protected $responseBody = 'Hello world';

    public function addRoute($routePath, $routeCallback)
    {
        // accept an anonymous function and bind it to the application object
        // can create a callback function that can manipulate the App instance state
        $this->routes[$routePath] = $routeCallback->bindTo($this, __CLASS__);
    }

    public function dispatch($currentPath)
    {
        foreach ($this->routes as $routePath => $callback) {
            if ($routePath === $currentPath) {
                $callback(); // invoke the matching route callback
            }
        }
        header('HTTP/1.1 ' . $this->responseStatus);
        header('Content-type: ' . $this->responseContentType);
        header('Content-length: ' . mb_strlen($this->responseBody));
        echo $this->responseBody;
    }
}

<?php
$app = new App();
$app->addRoute('/users/josh', function () {
    // reference the application object with $this keyword
    $this->responseContentType = 'application/json;charset=utf8';
    $this->responseBody = '{"name": "Josh"}';
});
$app->dispatch('/users/josh');
#+end_src

** 函数式编程

匿名函数可以被赋值给变量，或进行传递，也可用作回调函数。

#+caption: 函数赋值给变量
#+begin_src php
// 内置函数赋值给变量
$func = 'time';
echo $func();

// 自定义函数赋值给变量
$func = function ($arg) {
    echo 'Input: ' . $arg . "\n";
}; // 结尾有 ;
$func('test');
call_user_func($func, 'test');
#+end_src

#+caption: 函数作为参数和返回值
#+begin_src php
function twice($func) {
    return function ($arg) use ($func) { // 闭包
        return $func($func($arg));
    };
}
$func = twice(function ($arg) {
    return $arg * 2;
});
echo $func(3); // 12 = 3 * 2 * 2;
#+end_src

