programming/php/php.html

<div id="outline-container-sec-6-3-1" class="outline-4">
<h4 id="sec-6-3-1"><span class="section-number-4">6.3.1</span> Attach state</h4>
<div class="outline-text-4" id="text-6-3-1">
<p>
Attach state
</p>
<ul class="org-ul">
<li>with the closure object’s <code>bindTo()</code> method or the <code>use</code> keyword
</li>
<li>attached variable retains the value assigned to it at the time it is attached
</li>
</ul>

<p>
<code>use</code> example
</p>
<div class="org-src-container">

<pre class="src src-php"><span class="org-preprocessor">&lt;?php</span>
<span class="org-keyword">function</span> <span class="org-function-name">enclosePerson</span>($<span class="org-variable-name">name</span>) {
    <span class="org-keyword">return</span> <span class="org-keyword">function</span> ($<span class="org-variable-name">doCommand</span>) <span class="org-keyword">use</span> ($<span class="org-variable-name">name</span>) { <span class="org-comment-delimiter">// </span><span class="org-comment">attach multiple variables with ,</span>
        <span class="org-keyword">return</span> <span class="org-function-name">sprintf</span>(<span class="org-string">'%s, %s'</span>, $<span class="org-variable-name">name</span>, $<span class="org-variable-name">doCommand</span>);
    };
}
$<span class="org-variable-name">clay</span> = <span class="org-function-name">enclosePerson</span>(<span class="org-string">'Clay'</span>);
<span class="org-keyword">echo</span> <span class="org-function-name">$clay</span>(<span class="org-string">'get me sweet tea!'</span>);
<span class="org-comment-delimiter">// </span><span class="org-comment">Outputs --&gt; "Clay, get me sweet tea!"</span>
</pre>
</div>

<p>
<code>bindTo()</code>
</p>
<ul class="org-ul">
<li>can bind a <code>Closure</code> object’s internal state to a different object
</li>
<li>accept a second argument that specifies the PHP class of the object to which the closure is bound
</li>
<li>let the closure access protected and private member variables of the object to which it is bound
</li>
</ul>

<p>
<code>bindTo()</code> example
</p>
<div class="org-src-container">

<pre class="src src-php"><span class="org-preprocessor">&lt;?php</span>
<span class="org-keyword">class</span> <span class="org-type">App</span>
{
    <span class="org-keyword">protected</span> $<span class="org-variable-name">routes</span> = <span class="org-function-name">array</span>();
    <span class="org-keyword">protected</span> $<span class="org-variable-name">responseStatus</span> = <span class="org-string">'200 OK'</span>;
    <span class="org-keyword">protected</span> $<span class="org-variable-name">responseContentType</span> = <span class="org-string">'text/html'</span>;
    <span class="org-keyword">protected</span> $<span class="org-variable-name">responseBody</span> = <span class="org-string">'Hello world'</span>;

    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">addRoute</span>($<span class="org-variable-name">routePath</span>, $<span class="org-variable-name">routeCallback</span>)
    {
        <span class="org-comment-delimiter">// </span><span class="org-comment">accept an anonymous function and bind it to the application object</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">can create a callback function that can manipulate the App instance state</span>
        $<span class="org-constant">this</span>-<span class="org-constant">&gt;</span><span class="org-variable-name">routes</span>[$<span class="org-variable-name">routePath</span>] = $<span class="org-variable-name">routeCallback</span>-&gt;<span class="org-function-name">bindTo</span>($<span class="org-constant">this</span>, <span class="org-constant">__CLASS__</span>);
    }

    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">dispatch</span>($<span class="org-variable-name">currentPath</span>)
    {
        <span class="org-keyword">foreach</span> ($<span class="org-constant">this</span>-&gt;<span class="org-variable-name">routes</span> <span class="org-keyword">as</span> <span class="org-function-name">$routePath</span> =&gt; $<span class="org-variable-name">callback</span>) {
            <span class="org-keyword">if</span> ($<span class="org-variable-name">routePath</span> === $<span class="org-variable-name">currentPath</span>) {
                <span class="org-function-name">$callback</span>(); <span class="org-comment-delimiter">// </span><span class="org-comment">invoke the matching route callback</span>
            }
        }
        <span class="org-function-name">header</span>(<span class="org-string">'HTTP/1.1 '</span> . $<span class="org-constant">this</span>-&gt;<span class="org-variable-name">responseStatus</span>);
        <span class="org-function-name">header</span>(<span class="org-string">'Content-type: '</span> . $<span class="org-constant">this</span>-&gt;<span class="org-variable-name">responseContentType</span>);
        <span class="org-function-name">header</span>(<span class="org-string">'Content-length: '</span> . <span class="org-function-name">mb_strlen</span>($<span class="org-constant">this</span>-&gt;<span class="org-variable-name">responseBody</span>));
        <span class="org-keyword">echo</span> $<span class="org-constant">this</span>-&gt;<span class="org-variable-name">responseBody</span>;
    }
}

<span class="org-preprocessor">&lt;?php</span>
$<span class="org-variable-name">app</span> = <span class="org-keyword">new</span> <span class="org-type">App</span>();
$<span class="org-variable-name">app</span>-<span class="org-constant">&gt;</span><span class="org-function-name">addRoute</span>(<span class="org-string">'/users/josh'</span>, <span class="org-keyword">function</span> () {
    <span class="org-comment-delimiter">// </span><span class="org-comment">reference the application object with $this keyword</span>
    $<span class="org-constant">this</span>-&gt;<span class="org-variable-name">responseContentType</span> = <span class="org-string">'application/json;charset=utf8'</span>;
    $<span class="org-constant">this</span>-&gt;<span class="org-variable-name">responseBody</span> = <span class="org-string">'{"name": "Josh"}'</span>;
});
$<span class="org-variable-name">app</span>-&gt;<span class="org-function-name">dispatch</span>(<span class="org-string">'/users/josh'</span>);
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> 函数式编程</h3>
<div class="outline-text-3" id="text-6-4">
<p>
匿名函数可以被赋值给变量，或进行传递，也可用作回调函数。
</p>

<div class="org-src-container">
<label class="org-src-name">函数赋值给变量</label>
<pre class="src src-php"><span class="org-comment-delimiter">// </span><span class="org-comment">&#20869;&#32622;&#20989;&#25968;&#36171;&#20540;&#32473;&#21464;&#37327;</span>
$<span class="org-variable-name">func</span> = <span class="org-string">'time'</span>;
<span class="org-keyword">echo</span> <span class="org-function-name">$func</span>();

<span class="org-comment-delimiter">// </span><span class="org-comment">&#33258;&#23450;&#20041;&#20989;&#25968;&#36171;&#20540;&#32473;&#21464;&#37327;</span>
$<span class="org-variable-name">func</span> = <span class="org-keyword">function</span> ($<span class="org-variable-name">arg</span>) {
    <span class="org-keyword">echo</span> <span class="org-string">'Input: '</span> . $<span class="org-variable-name">arg</span> . <span class="org-string">"\n"</span>;
}; <span class="org-comment-delimiter">// </span><span class="org-comment">&#32467;&#23614;&#26377; ;</span>
<span class="org-function-name">$func</span>(<span class="org-string">'test'</span>);
<span class="org-function-name">call_user_func</span>($<span class="org-variable-name">func</span>, <span class="org-string">'test'</span>);
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">函数作为参数和返回值</label>
<pre class="src src-php"><span class="org-keyword">function</span> <span class="org-function-name">twice</span>($<span class="org-variable-name">func</span>) {
    <span class="org-keyword">return</span> <span class="org-keyword">function</span> ($<span class="org-variable-name">arg</span>) <span class="org-keyword">use</span> ($<span class="org-variable-name">func</span>) { <span class="org-comment-delimiter">// </span><span class="org-comment">&#38381;&#21253;</span>
        <span class="org-keyword">return</span> <span class="org-function-name">$func</span>(<span class="org-function-name">$func</span>($<span class="org-variable-name">arg</span>));
    };
}
$<span class="org-variable-name">func</span> = <span class="org-function-name">twice</span>(<span class="org-keyword">function</span> ($<span class="org-variable-name">arg</span>) {
    <span class="org-keyword">return</span> $<span class="org-variable-name">arg</span> * <span class="org-default">2</span>;
});
<span class="org-keyword">echo</span> <span class="org-function-name">$func</span>(<span class="org-default">3</span>); <span class="org-comment-delimiter">// </span><span class="org-comment">12 = 3 * 2 * 2;</span>
</pre>
</div>
</div>
</div>
