programming/php/php.org
** 回调函数

#+caption: 二维数组的元素使用指定键值进行排序
#+begin_src php
$array = array(
    array('a' => 3),
    array('a' => 1),
    array('a' => 2),
);
$column = 'a';
usort($array, function ($a, $b) use ($column) {
    return ($a[$column] < $b[$column]) ? -1 : 1;
});
#+end_src

#+caption: 二维数组提取指定键值
#+begin_src php
$data = array(
    array('value' => 'a'),
    array('value' => 'b'),
    array('value' => 'c'),
);
$values = array_map(function ($a) {
    return $a['value'];
}, $data);
// array('a', 'b', 'c');
#+end_src

#+caption: 数组元素累加
#+begin_src php
$nums = array(1, 2, 3);
$sum = array_reduce($nums, function ($carry, $item) {
    $carry += $item;
    return $carry;
});
#+end_src

* OO
** 对象
*** 对象 ID

每一个 PHP 对象有唯一的 ID，对象被销毁之后，ID 会被回收并重复使用。

#+begin_src php
namespace Foo;
class Bar {}
$bar = new Bar();
var_dump($bar);
// object(Foo\Bar)#1 (0) {}
#+end_src

*** 打印对象

#+caption: PHP 5.2 之前可以直接打印对象。
#+begin_src php
class Bar {}
$bar = new Bar();
print $bar;
// Object id #1
#+end_src

#+caption: PHP 5.2 之后类必须实现 =__toString()= 方法才可以打印对象。
#+begin_src php
class Bar {
    public function __toString() {
        return 'This is an object.';
    }
}
$bar = new Bar();
print $bar;
// This is an object.
#+end_src

** 可见性

| =public=    | 默认可见性，可以被任何代码使用                     |
|-------------+----------------------------------------------------|
| =protected= | 只能被当前类和子类的方法使用                       |
|-------------+----------------------------------------------------|
| =private=   | 只能被当前类的方法使用，不能被子类的方法继承或使用 |

一般先将成员声明为 =private= 或 =protected= ，只在必要时增加其可见性。

** 属性

#+caption: 未声明的属性可以动态添加，但不是良好的习惯，发生拼写错误时不会得到警告。
#+begin_src php
class Foo {
    public $bar;
}
$foo = new Foo();
$foo->baz = '123';
#+end_src

** 常量

常量必须定义值，且只能定义为原始类型的值。常量只能通过类而不是对象进行访问。

#+begin_src php
class Foo {
    const BAR; // Parse error: syntax error, unexpected ';', expecting '=' ...
    const BAZ = 1;
}
Foo::BAZ = 2; // Parse error: syntax error, unexpected '=' ...
#+end_src

** 静态

一般成员在类实例之间各不相同，静态成员在类的所有实例中保持不变。静态成员在类而不是对象的上下文中引用，因此静态方法不能访问普通属性或 =$this= （属于对象而不是类）。

使用静态成员可以减少实例化类造成的开销（overhead）。

*** 示例

#+begin_src php
class Foo {
    public static $bar = 'test';   // 声明静态属性
    public static function one() { // 声明静态方法
        echo self::$bar;           // 引用静态属性
    }
    public function two() {
        self::one();               // 引用静态方法
    }
}
$a = Foo::$bar; // 引用静态属性
Foo::one();     // 引用静态方法
#+end_src

*** 静态方法

#+caption: 静态方法可以作为工厂方法，生成不同的示例。
#+begin_src php
class Foo {
    public static function getFoo(int $type = 1) {
        switch ($type) {
            case 1:
                return new FooOne();
            case 2:
                return new FooTwo();
        }
    }
}

class FooOne extends Foo {}
class FooTwo extends Foo {}

$foo1 = Foo::getFoo(1);
$foo2 = Foo::getFoo(2);
#+end_src

