programming/php/php.html
<div id="outline-container-sec-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> 回调函数</h3>
<div class="outline-text-3" id="text-6-5">
<div class="org-src-container">
<label class="org-src-name">二维数组的元素使用指定键值进行排序</label>
<pre class="src src-php">$<span class="org-variable-name">array</span> = <span class="org-function-name">array</span>(
    <span class="org-function-name">array</span>(<span class="org-string">'a'</span> =&gt; <span class="org-default">3</span>),
    <span class="org-function-name">array</span>(<span class="org-string">'a'</span> =&gt; <span class="org-default">1</span>),
    <span class="org-function-name">array</span>(<span class="org-string">'a'</span> =&gt; <span class="org-default">2</span>),
);
$<span class="org-variable-name">column</span> = <span class="org-string">'a'</span>;
<span class="org-function-name">usort</span>($<span class="org-variable-name">array</span>, <span class="org-keyword">function</span> ($<span class="org-variable-name">a</span>, $<span class="org-variable-name">b</span>) <span class="org-keyword">use</span> ($<span class="org-variable-name">column</span>) {
    <span class="org-keyword">return</span> ($<span class="org-variable-name">a</span>[$<span class="org-variable-name">column</span>] &lt; $<span class="org-variable-name">b</span>[$<span class="org-variable-name">column</span>]) ? -<span class="org-default">1</span> : <span class="org-default">1</span>;
});
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">二维数组提取指定键值</label>
<pre class="src src-php">$<span class="org-variable-name">data</span> = <span class="org-function-name">array</span>(
    <span class="org-function-name">array</span>(<span class="org-string">'value'</span> =&gt; <span class="org-string">'a'</span>),
    <span class="org-function-name">array</span>(<span class="org-string">'value'</span> =&gt; <span class="org-string">'b'</span>),
    <span class="org-function-name">array</span>(<span class="org-string">'value'</span> =&gt; <span class="org-string">'c'</span>),
);
$<span class="org-variable-name">values</span> = <span class="org-function-name">array_map</span>(<span class="org-keyword">function</span> ($<span class="org-variable-name">a</span>) {
    <span class="org-keyword">return</span> $<span class="org-variable-name">a</span>[<span class="org-string">'value'</span>];
}, $<span class="org-variable-name">data</span>);
<span class="org-comment-delimiter">// </span><span class="org-comment">array('a', 'b', 'c');</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">数组元素累加</label>
<pre class="src src-php">$<span class="org-variable-name">nums</span> = <span class="org-function-name">array</span>(<span class="org-default">1</span>, <span class="org-default">2</span>, <span class="org-default">3</span>);
$<span class="org-variable-name">sum</span> = <span class="org-function-name">array_reduce</span>($<span class="org-variable-name">nums</span>, <span class="org-keyword">function</span> ($<span class="org-variable-name">carry</span>, $<span class="org-variable-name">item</span>) {
    $<span class="org-variable-name">carry</span> += $<span class="org-variable-name">item</span>;
    <span class="org-keyword">return</span> $<span class="org-variable-name">carry</span>;
});
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> OO</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> 对象</h3>
<div class="outline-text-3" id="text-7-1">
</div><div id="outline-container-sec-7-1-1" class="outline-4">
<h4 id="sec-7-1-1"><span class="section-number-4">7.1.1</span> 对象 ID</h4>
<div class="outline-text-4" id="text-7-1-1">
<p>
每一个 PHP 对象有唯一的 ID，对象被销毁之后，ID 会被回收并重复使用。
</p>

<div class="org-src-container">

<pre class="src src-php"><span class="org-keyword">namespace</span> <span class="org-type">Foo</span>;
<span class="org-keyword">class</span> <span class="org-type">Bar</span> {}
$<span class="org-variable-name">bar</span> = <span class="org-keyword">new</span> <span class="org-type">Bar</span>();
<span class="org-function-name">var_dump</span>($<span class="org-variable-name">bar</span>);
<span class="org-comment-delimiter">// </span><span class="org-comment">object(Foo\Bar)#1 (0) {}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7-1-2" class="outline-4">
<h4 id="sec-7-1-2"><span class="section-number-4">7.1.2</span> 打印对象</h4>
<div class="outline-text-4" id="text-7-1-2">
<div class="org-src-container">
<label class="org-src-name">PHP 5.2 之前可以直接打印对象。</label>
<pre class="src src-php"><span class="org-keyword">class</span> <span class="org-type">Bar</span> {}
$<span class="org-variable-name">bar</span> = <span class="org-keyword">new</span> <span class="org-type">Bar</span>();
<span class="org-keyword">print</span> $<span class="org-variable-name">bar</span>;
<span class="org-comment-delimiter">// </span><span class="org-comment">Object id #1</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">PHP 5.2 之后类必须实现 <code>__toString()</code> 方法才可以打印对象。</label>
<pre class="src src-php"><span class="org-keyword">class</span> <span class="org-type">Bar</span> {
    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">__toString</span>() {
        <span class="org-keyword">return</span> <span class="org-string">'This is an object.'</span>;
    }
}
$<span class="org-variable-name">bar</span> = <span class="org-keyword">new</span> <span class="org-type">Bar</span>();
<span class="org-keyword">print</span> $<span class="org-variable-name">bar</span>;
<span class="org-comment-delimiter">// </span><span class="org-comment">This is an object.</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> 可见性</h3>
<div class="outline-text-3" id="text-7-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><code>public</code></th>
<th scope="col" class="left">默认可见性，可以被任何代码使用</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>protected</code></td>
<td class="left">只能被当前类和子类的方法使用</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>private</code></td>
<td class="left">只能被当前类的方法使用，不能被子类的方法继承或使用</td>
</tr>
</tbody>
</table>

<p>
一般先将成员声明为 <code>private</code> 或 <code>protected</code> ，只在必要时增加其可见性。
</p>
</div>
</div>
<div id="outline-container-sec-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> 属性</h3>
<div class="outline-text-3" id="text-7-3">
<div class="org-src-container">
<label class="org-src-name">未声明的属性可以动态添加，但不是良好的习惯，发生拼写错误时不会得到警告。</label>
<pre class="src src-php"><span class="org-keyword">class</span> <span class="org-type">Foo</span> {
    <span class="org-keyword">public</span> $<span class="org-variable-name">bar</span>;
}
$<span class="org-variable-name">foo</span> = <span class="org-keyword">new</span> <span class="org-type">Foo</span>();
$<span class="org-variable-name">foo</span>-&gt;<span class="org-variable-name">baz</span> = <span class="org-string">'123'</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7-4" class="outline-3">
<h3 id="sec-7-4"><span class="section-number-3">7.4</span> 常量</h3>
<div class="outline-text-3" id="text-7-4">
<p>
常量必须定义值，且只能定义为原始类型的值。常量只能通过类而不是对象进行访问。
</p>

<div class="org-src-container">

<pre class="src src-php"><span class="org-keyword">class</span> <span class="org-type">Foo</span> {
    <span class="org-keyword">const</span> <span class="org-constant">BAR</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">Parse error: syntax error, unexpected ';', expecting '=' ...</span>
    <span class="org-keyword">const</span> <span class="org-constant">BAZ</span> = <span class="org-default">1</span>;
}
<span class="org-type">Foo</span>::<span class="org-constant">BAZ</span> = <span class="org-default">2</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">Parse error: syntax error, unexpected '=' ...</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7-5" class="outline-3">
<h3 id="sec-7-5"><span class="section-number-3">7.5</span> 静态</h3>
<div class="outline-text-3" id="text-7-5">
<p>
一般成员在类实例之间各不相同，静态成员在类的所有实例中保持不变。静态成员在类而不是对象的上下文中引用，因此静态方法不能访问普通属性或 <code>$this</code> （属于对象而不是类）。
</p>

<p>
使用静态成员可以减少实例化类造成的开销（overhead）。
</p>
</div>

<div id="outline-container-sec-7-5-1" class="outline-4">
<h4 id="sec-7-5-1"><span class="section-number-4">7.5.1</span> 示例</h4>
<div class="outline-text-4" id="text-7-5-1">
<div class="org-src-container">

<pre class="src src-php"><span class="org-keyword">class</span> <span class="org-type">Foo</span> {
    <span class="org-keyword">public</span> <span class="org-keyword">static</span> $<span class="org-variable-name">bar</span> = <span class="org-string">'test'</span>;   <span class="org-comment-delimiter">// </span><span class="org-comment">&#22768;&#26126;&#38745;&#24577;&#23646;&#24615;</span>
    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-keyword">function</span> <span class="org-function-name">one</span>() { <span class="org-comment-delimiter">// </span><span class="org-comment">&#22768;&#26126;&#38745;&#24577;&#26041;&#27861;</span>
        <span class="org-keyword">echo</span> <span class="org-constant">self</span>::$<span class="org-variable-name">bar</span>;           <span class="org-comment-delimiter">// </span><span class="org-comment">&#24341;&#29992;&#38745;&#24577;&#23646;&#24615;</span>
    }
    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">two</span>() {
        <span class="org-constant">self</span>::<span class="org-function-name">one</span>();               <span class="org-comment-delimiter">// </span><span class="org-comment">&#24341;&#29992;&#38745;&#24577;&#26041;&#27861;</span>
    }
}
$<span class="org-variable-name">a</span> = <span class="org-type">Foo</span>::$<span class="org-variable-name">bar</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">&#24341;&#29992;&#38745;&#24577;&#23646;&#24615;</span>
<span class="org-type">Foo</span>::<span class="org-function-name">one</span>();     <span class="org-comment-delimiter">// </span><span class="org-comment">&#24341;&#29992;&#38745;&#24577;&#26041;&#27861;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7-5-2" class="outline-4">
<h4 id="sec-7-5-2"><span class="section-number-4">7.5.2</span> 静态方法</h4>
<div class="outline-text-4" id="text-7-5-2">
<div class="org-src-container">
<label class="org-src-name">静态方法可以作为工厂方法，生成不同的示例。</label>
<pre class="src src-php"><span class="org-keyword">class</span> <span class="org-type">Foo</span> {
    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-keyword">function</span> <span class="org-function-name">getFoo</span>(<span class="org-type">int</span> $<span class="org-variable-name">type</span> = <span class="org-default">1</span>) {
        <span class="org-keyword">switch</span> ($<span class="org-variable-name">type</span>) {
            <span class="org-keyword">case</span> <span class="org-constant">1</span>:
                <span class="org-keyword">return</span> <span class="org-keyword">new</span> <span class="org-type">FooOne</span>();
            <span class="org-keyword">case</span> <span class="org-constant">2</span>:
                <span class="org-keyword">return</span> <span class="org-keyword">new</span> <span class="org-type">FooTwo</span>();
        }
    }
}

<span class="org-keyword">class</span> <span class="org-type">FooOne</span> <span class="org-keyword">extends</span> <span class="org-type">Foo</span> {}
<span class="org-keyword">class</span> <span class="org-type">FooTwo</span> <span class="org-keyword">extends</span> <span class="org-type">Foo</span> {}

$<span class="org-variable-name">foo1</span> = <span class="org-type">Foo</span>::<span class="org-function-name">getFoo</span>(<span class="org-default">1</span>);
$<span class="org-variable-name">foo2</span> = <span class="org-type">Foo</span>::<span class="org-function-name">getFoo</span>(<span class="org-default">2</span>);
</pre>
</div>
</div>
</div>
</div>
