programming/php/php.org
** 抽象

抽象类和抽象方法用来确保子类中一定会包含和重载（override）某些方法。接口也可以实现同样目的。

#+begin_src php
abstract class Foo {
    abstract function operation($param1, $param2);
}

class Bar extends Foo {
    function operation($param1, $param2) {}
}
#+end_src

*** 抽象方法

抽象方法是只有签名而没有实现的方法。

#+begin_src php
class Foo {
    abstract public function bar();
}
#+end_src

*** 抽象类

抽象类不能被实例化。

定义了抽象方法的类必须为抽象类，但抽象类也可以定义有实现的非抽象方法。

抽象类的作用是定义一种接口。继承了抽象类的子类，必须实现基类的所有抽象方法（且方法签名必须一致），或本身被声明被抽象类。

** 接口

#+begin_src php
interface Foo {}
interface Bar {}
class Concrete implements Foo, Bar {}
#+end_src

接口只有成员的声明，没有实现。

一个类只能继承一个父类，但可以实现多个接口（只要接口中没有与此类重名的方法）。实现接口的类必须实现接口定义的方法，或被声明为抽象类。

#+caption: 实现了接口的类就具有了接口的类型。
#+begin_src php
interface Foo {}
interface Bar {}
class Hoge implements Foo, Bar {}

$hoge = new Hoge();
echo ($hoge instanceof Foo); // 1
echo ($hoge instanceof Bar); // 1
#+end_src

接口是对象之间的契约（contract），可以将代码和它的依赖解耦，因为面向对象的代码只能使用固定类的对象，而面向接口的代码可以使用任何实现了接口的对象，更加灵活。

#+begin_src php
interface Bar {}
class BarOne implements Bar {}
class BarTwo implements Bar {}

function bar(Bar $arg) {} // 面向接口

bar(new BarOne());
bar(new BarTwo());
#+end_src

** =final= 类

#+begin_src php
final class Foo {}      // final 类无法被继承
final function foo() {} // final 方法在子类中无法被重载
final public function bar() {} // final 关键字在最前
#+end_src

** Trait

继承不支持多个基类，而接口不提供实现，trait 提供了复用部分（partial）实现的代码的方式，而使用 trait 的类（在继承关系中）可以是不相关的。Trait 改变类的功能，但不改变类型。

Trait 语法类似于类，但不能被实例化。PHP 在编译时将 trait 代码复制到引用 trait 的位置。

*** 语法

#+begin_src php
trait Foo {} // 定义
trait Bar {}
class Hego {
    use Foo, Bar; // 使用
}
#+end_src

#+caption: 含有同名方法时，类中的方法会覆盖 trait 的方法。
#+begin_src php
trait Foo {
    public function run() {
        echo 'foo';
    }
}

class Bar {
    use Foo;
    public function run() {
        echo 'bar';
    }
}

$bar = new Bar();
$bar->run(); // bar
#+end_src

#+caption: Trait 可以访问宿主的属性和方法，但是无法保证宿主类含有指定的属性和方法，所以应该避免。
#+begin_src php
trait Foo {
    public function foo() {
        echo $this->prefix . '-' . $this->getSuffix();
    }
}

class Bar {
    use Foo;
    private $prefix = '123';
    private function getSuffix() {
        return '456';
    }
}

$bar= new Bar();
$bar->foo(); // 123-456
#+end_src

*** =as=

#+caption: 为 trait 方法指定别名。
#+begin_src php
trait Foo {
    public function run() {}
}

class Bar {
    use Foo {
        Foo::run as fooRun;
    }
    public function run() {}
}

$bar = new Bar();
$bar->fooRun(); // Foo::run()
$bar->run();    // Bar::run()
#+end_src

#+caption: 修改 trait 方法的可见性。
#+begin_src php
trait Foo {
    private function foo() {}
}

class Bar {
    use Foo {
        Foo::foo as public;
    }
}

$bar= new Bar();
$bar->foo();
#+end_src

