programming/php/php.html
<div id="outline-container-sec-7-6" class="outline-3">
<h3 id="sec-7-6"><span class="section-number-3">7.6</span> 抽象</h3>
<div class="outline-text-3" id="text-7-6">
<p>
抽象类和抽象方法用来确保子类中一定会包含和重载（override）某些方法。接口也可以实现同样目的。
</p>

<div class="org-src-container">

<pre class="src src-php"><span class="org-keyword">abstract</span> <span class="org-keyword">class</span> <span class="org-type">Foo</span> {
    <span class="org-keyword">abstract</span> <span class="org-keyword">function</span> <span class="org-function-name">operation</span>($<span class="org-variable-name">param1</span>, $<span class="org-variable-name">param2</span>);
}

<span class="org-keyword">class</span> <span class="org-type">Bar</span> <span class="org-keyword">extends</span> <span class="org-type">Foo</span> {
    <span class="org-keyword">function</span> <span class="org-function-name">operation</span>($<span class="org-variable-name">param1</span>, $<span class="org-variable-name">param2</span>) {}
}
</pre>
</div>
</div>

<div id="outline-container-sec-7-6-1" class="outline-4">
<h4 id="sec-7-6-1"><span class="section-number-4">7.6.1</span> 抽象方法</h4>
<div class="outline-text-4" id="text-7-6-1">
<p>
抽象方法是只有签名而没有实现的方法。
</p>

<div class="org-src-container">

<pre class="src src-php"><span class="org-keyword">class</span> <span class="org-type">Foo</span> {
    <span class="org-keyword">abstract</span> <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">bar</span>();
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7-6-2" class="outline-4">
<h4 id="sec-7-6-2"><span class="section-number-4">7.6.2</span> 抽象类</h4>
<div class="outline-text-4" id="text-7-6-2">
<p>
抽象类不能被实例化。
</p>

<p>
定义了抽象方法的类必须为抽象类，但抽象类也可以定义有实现的非抽象方法。
</p>

<p>
抽象类的作用是定义一种接口。继承了抽象类的子类，必须实现基类的所有抽象方法（且方法签名必须一致），或本身被声明被抽象类。
</p>
</div>
</div>
</div>
<div id="outline-container-sec-7-7" class="outline-3">
<h3 id="sec-7-7"><span class="section-number-3">7.7</span> 接口</h3>
<div class="outline-text-3" id="text-7-7">
<div class="org-src-container">

<pre class="src src-php"><span class="org-keyword">interface</span> <span class="org-type">Foo</span> {}
<span class="org-keyword">interface</span> <span class="org-type">Bar</span> {}
<span class="org-keyword">class</span> <span class="org-type">Concrete</span> <span class="org-keyword">implements</span> <span class="org-type">Foo, Bar</span> {}
</pre>
</div>

<p>
接口只有成员的声明，没有实现。
</p>

<p>
一个类只能继承一个父类，但可以实现多个接口（只要接口中没有与此类重名的方法）。实现接口的类必须实现接口定义的方法，或被声明为抽象类。
</p>

<div class="org-src-container">
<label class="org-src-name">实现了接口的类就具有了接口的类型。</label>
<pre class="src src-php"><span class="org-keyword">interface</span> <span class="org-type">Foo</span> {}
<span class="org-keyword">interface</span> <span class="org-type">Bar</span> {}
<span class="org-keyword">class</span> <span class="org-type">Hoge</span> <span class="org-keyword">implements</span> <span class="org-type">Foo, Bar</span> {}

$<span class="org-variable-name">hoge</span> = <span class="org-keyword">new</span> <span class="org-type">Hoge</span>();
<span class="org-keyword">echo</span> ($<span class="org-variable-name">hoge</span> <span class="org-keyword">instanceof</span> <span class="org-type">Foo</span>); <span class="org-comment-delimiter">// </span><span class="org-comment">1</span>
<span class="org-keyword">echo</span> ($<span class="org-variable-name">hoge</span> <span class="org-keyword">instanceof</span> <span class="org-type">Bar</span>); <span class="org-comment-delimiter">// </span><span class="org-comment">1</span>
</pre>
</div>

<p>
接口是对象之间的契约（contract），可以将代码和它的依赖解耦，因为面向对象的代码只能使用固定类的对象，而面向接口的代码可以使用任何实现了接口的对象，更加灵活。
</p>

<div class="org-src-container">

<pre class="src src-php"><span class="org-keyword">interface</span> <span class="org-type">Bar</span> {}
<span class="org-keyword">class</span> <span class="org-type">BarOne</span> <span class="org-keyword">implements</span> <span class="org-type">Bar</span> {}
<span class="org-keyword">class</span> <span class="org-type">BarTwo</span> <span class="org-keyword">implements</span> <span class="org-type">Bar</span> {}

<span class="org-keyword">function</span> <span class="org-function-name">bar</span>(<span class="org-type">Bar</span> $<span class="org-variable-name">arg</span>) {} <span class="org-comment-delimiter">// </span><span class="org-comment">&#38754;&#21521;&#25509;&#21475;</span>

<span class="org-function-name">bar</span>(<span class="org-keyword">new</span> <span class="org-type">BarOne</span>());
<span class="org-function-name">bar</span>(<span class="org-keyword">new</span> <span class="org-type">BarTwo</span>());
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7-8" class="outline-3">
<h3 id="sec-7-8"><span class="section-number-3">7.8</span> <code>final</code> 类</h3>
<div class="outline-text-3" id="text-7-8">
<div class="org-src-container">

<pre class="src src-php"><span class="org-keyword">final</span> <span class="org-keyword">class</span> <span class="org-type">Foo</span> {}      <span class="org-comment-delimiter">// </span><span class="org-comment">final &#31867;&#26080;&#27861;&#34987;&#32487;&#25215;</span>
<span class="org-keyword">final</span> <span class="org-keyword">function</span> <span class="org-function-name">foo</span>() {} <span class="org-comment-delimiter">// </span><span class="org-comment">final &#26041;&#27861;&#22312;&#23376;&#31867;&#20013;&#26080;&#27861;&#34987;&#37325;&#36733;</span>
<span class="org-keyword">final</span> <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">bar</span>() {} <span class="org-comment-delimiter">// </span><span class="org-comment">final &#20851;&#38190;&#23383;&#22312;&#26368;&#21069;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7-9" class="outline-3">
<h3 id="sec-7-9"><span class="section-number-3">7.9</span> Trait</h3>
<div class="outline-text-3" id="text-7-9">
<p>
继承不支持多个基类，而接口不提供实现，trait 提供了复用部分（partial）实现的代码的方式，而使用 trait 的类（在继承关系中）可以是不相关的。Trait 改变类的功能，但不改变类型。
</p>

<p>
Trait 语法类似于类，但不能被实例化。PHP 在编译时将 trait 代码复制到引用 trait 的位置。
</p>
</div>

<div id="outline-container-sec-7-9-1" class="outline-4">
<h4 id="sec-7-9-1"><span class="section-number-4">7.9.1</span> 语法</h4>
<div class="outline-text-4" id="text-7-9-1">
<div class="org-src-container">

<pre class="src src-php"><span class="org-keyword">trait</span> <span class="org-type">Foo</span> {} <span class="org-comment-delimiter">// </span><span class="org-comment">&#23450;&#20041;</span>
<span class="org-keyword">trait</span> <span class="org-type">Bar</span> {}
<span class="org-keyword">class</span> <span class="org-type">Hego</span> {
    <span class="org-keyword">use</span> <span class="org-type">Foo, Bar</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">&#20351;&#29992;</span>
}
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">含有同名方法时，类中的方法会覆盖 trait 的方法。</label>
<pre class="src src-php"><span class="org-keyword">trait</span> <span class="org-type">Foo</span> {
    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">run</span>() {
        <span class="org-keyword">echo</span> <span class="org-string">'foo'</span>;
    }
}

<span class="org-keyword">class</span> <span class="org-type">Bar</span> {
    <span class="org-keyword">use</span> <span class="org-type">Foo</span>;
    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">run</span>() {
        <span class="org-keyword">echo</span> <span class="org-string">'bar'</span>;
    }
}

$<span class="org-variable-name">bar</span> = <span class="org-keyword">new</span> <span class="org-type">Bar</span>();
$<span class="org-variable-name">bar</span>-&gt;<span class="org-function-name">run</span>(); <span class="org-comment-delimiter">// </span><span class="org-comment">bar</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">Trait 可以访问宿主的属性和方法，但是无法保证宿主类含有指定的属性和方法，所以应该避免。</label>
<pre class="src src-php"><span class="org-keyword">trait</span> <span class="org-type">Foo</span> {
    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">foo</span>() {
        <span class="org-keyword">echo</span> $<span class="org-constant">this</span>-&gt;<span class="org-variable-name">prefix</span> . <span class="org-string">'-'</span> . $<span class="org-constant">this</span>-&gt;<span class="org-function-name">getSuffix</span>();
    }
}

<span class="org-keyword">class</span> <span class="org-type">Bar</span> {
    <span class="org-keyword">use</span> <span class="org-type">Foo</span>;
    <span class="org-keyword">private</span> $<span class="org-variable-name">prefix</span> = <span class="org-string">'123'</span>;
    <span class="org-keyword">private</span> <span class="org-keyword">function</span> <span class="org-function-name">getSuffix</span>() {
        <span class="org-keyword">return</span> <span class="org-string">'456'</span>;
    }
}

$<span class="org-variable-name">bar</span>= <span class="org-keyword">new</span> <span class="org-type">Bar</span>();
$<span class="org-variable-name">bar</span>-&gt;<span class="org-function-name">foo</span>(); <span class="org-comment-delimiter">// </span><span class="org-comment">123-456</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7-9-2" class="outline-4">
<h4 id="sec-7-9-2"><span class="section-number-4">7.9.2</span> <code>as</code></h4>
<div class="outline-text-4" id="text-7-9-2">
<div class="org-src-container">
<label class="org-src-name">为 trait 方法指定别名。</label>
<pre class="src src-php"><span class="org-keyword">trait</span> <span class="org-type">Foo</span> {
    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">run</span>() {}
}

<span class="org-keyword">class</span> <span class="org-type">Bar</span> {
    <span class="org-keyword">use</span> <span class="org-type">Foo</span> {
        <span class="org-type">Foo</span>::<span class="org-constant">run</span> <span class="org-keyword">as</span> <span class="org-function-name">fooRun</span>;
    }
    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">run</span>() {}
}

$<span class="org-variable-name">bar</span> = <span class="org-keyword">new</span> <span class="org-type">Bar</span>();
$<span class="org-variable-name">bar</span>-&gt;<span class="org-function-name">fooRun</span>(); <span class="org-comment-delimiter">// </span><span class="org-comment">Foo::run()</span>
$<span class="org-variable-name">bar</span>-&gt;<span class="org-function-name">run</span>();    <span class="org-comment-delimiter">// </span><span class="org-comment">Bar::run()</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">修改 trait 方法的可见性。</label>
<pre class="src src-php"><span class="org-keyword">trait</span> <span class="org-type">Foo</span> {
    <span class="org-keyword">private</span> <span class="org-keyword">function</span> <span class="org-function-name">foo</span>() {}
}

<span class="org-keyword">class</span> <span class="org-type">Bar</span> {
    <span class="org-keyword">use</span> <span class="org-type">Foo</span> {
        <span class="org-type">Foo</span>::<span class="org-constant">foo</span> <span class="org-keyword">as</span> <span class="org-keyword">public</span>;
    }
}

$<span class="org-variable-name">bar</span>= <span class="org-keyword">new</span> <span class="org-type">Bar</span>();
$<span class="org-variable-name">bar</span>-&gt;<span class="org-function-name">foo</span>();
</pre>
</div>
</div>
</div>
