programming/php/php.org
*** =insteadof=

两个 trait 包含同名方法时，用 =insteadof= 指定要使用的方法，避免冲突。

#+begin_src php
trait Foo {
    public function run() {}
}

trait Bar {
    public function run() {}
}

class Hoge {
    use Foo, Bar {
        Bar::run insteadof Foo; // 指定使用 Bar 的 run()
        Foo::run as fooRun;     // 通过别名使用 Foo 的 run()
    }
}
#+end_src

*** 静态方法

#+begin_src php
trait Foo {
    public static function run() {}
}

class Bar {
    use Foo;
}

$bar = new Bar();
$bar::run();
#+end_src

*** 抽象方法

#+caption: 通过定义抽象方法，trait 可以确保包含它的类一定会实现指定方法。
#+begin_src php
trait Foo {
    abstract function getText(): string;
    public function output() {
        echo $this->getText();
    }
}

class Bar {
    use Foo;
    private function getText(): string {
        return 'text';
    }
}

$bar= new Bar();
$bar->output(); // text
#+end_src

*** 示例

#+begin_src php
trait Logger {
    private $logFile;
    public function logError(string $msg = 'unknown') {
        echo '[file=' . $this->logFile . '] [msg=' . $msg . ']';
    }
}

class Foo {
    use Logger;
    public function __construct() {
        $this->logFile = 'foo.log';
    }
}

class Bar {
    use Logger;
    public function __construct() {
        $this->logFile = 'bar.log';
    }
}

$foo = new Foo();
$foo->logError(); // [file=foo.log] [msg=unknown]
$bar = new Bar();
$bar->logError(); // [file=bar.log] [msg=unknown]
#+end_src

** =::= 运算符

在类而不是对象上下文中引用方法时，使用 =::= 而不是 =->= 。

*** =parent=

=parent::<method>()= 是唯一可以用静态语法调用非静态方法的场合。

#+begin_src php
class Foo {
    public function __construct() {}
}
class Bar extends Foo {
    public function __construct() {
        parent::__construct();
        // ...
    }
}
#+end_src

*** =self=

类的 =self= 相当于对象的 =$this= 。

#+begin_src php
class Foo {
    protected static $counter = 0;
    public static function visit() {
        self::$counter++;
    }
    public static function create() {
        return new self();
    }
}
#+end_src

#+caption: =self= 得解析不依赖于调用时的上下文，而是定义位置。
#+begin_src php
abstract class Foo {
    public static function create() {
        return new self(); // self == Foo
    }
}
class Bar extends Foo {}
$bar = Bar::create();
// Fatal error: Uncaught Error: Cannot instantiate abstract class Foo ...
#+end_src

*** =static=

PHP 5.3 引入 late static binding，以解决基类中 =self= 无法解析为子类的问题。

#+begin_src php
abstract class Foo {
    public static function create() {
        return new static(); // static == 调用时的类
    }
    public function output() {
        echo static::getName(); // static 可以在非静态上下文中，以静态语法调用静态或非静态方法
    }
}
class Bar extends Foo {
    public $name = 'Bar';
    protected function getName() {
        return $this->name;
    }
}
$bar = Bar::create();
echo get_class($bar); // Bar
$bar->output();       // Bar
#+end_src

