programming/php/php.html
<div id="outline-container-sec-7-9-3" class="outline-4">
<h4 id="sec-7-9-3"><span class="section-number-4">7.9.3</span> <code>insteadof</code></h4>
<div class="outline-text-4" id="text-7-9-3">
<p>
两个 trait 包含同名方法时，用 <code>insteadof</code> 指定要使用的方法，避免冲突。
</p>

<div class="org-src-container">

<pre class="src src-php"><span class="org-keyword">trait</span> <span class="org-type">Foo</span> {
    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">run</span>() {}
}

<span class="org-keyword">trait</span> <span class="org-type">Bar</span> {
    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">run</span>() {}
}

<span class="org-keyword">class</span> <span class="org-type">Hoge</span> {
    <span class="org-keyword">use</span> <span class="org-type">Foo, Bar</span> {
        <span class="org-type">Bar</span>::<span class="org-constant">run</span> <span class="org-keyword">insteadof</span> <span class="org-type">Foo</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">&#25351;&#23450;&#20351;&#29992; Bar &#30340; run()</span>
        <span class="org-type">Foo</span>::<span class="org-constant">run</span> <span class="org-keyword">as</span> <span class="org-function-name">fooRun</span>;     <span class="org-comment-delimiter">// </span><span class="org-comment">&#36890;&#36807;&#21035;&#21517;&#20351;&#29992; Foo &#30340; run()</span>
    }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7-9-4" class="outline-4">
<h4 id="sec-7-9-4"><span class="section-number-4">7.9.4</span> 静态方法</h4>
<div class="outline-text-4" id="text-7-9-4">
<div class="org-src-container">

<pre class="src src-php"><span class="org-keyword">trait</span> <span class="org-type">Foo</span> {
    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-keyword">function</span> <span class="org-function-name">run</span>() {}
}

<span class="org-keyword">class</span> <span class="org-type">Bar</span> {
    <span class="org-keyword">use</span> <span class="org-type">Foo</span>;
}

$<span class="org-variable-name">bar</span> = <span class="org-keyword">new</span> <span class="org-type">Bar</span>();
$<span class="org-variable-name">bar</span>::<span class="org-function-name">run</span>();
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7-9-5" class="outline-4">
<h4 id="sec-7-9-5"><span class="section-number-4">7.9.5</span> 抽象方法</h4>
<div class="outline-text-4" id="text-7-9-5">
<div class="org-src-container">
<label class="org-src-name">通过定义抽象方法，trait 可以确保包含它的类一定会实现指定方法。</label>
<pre class="src src-php"><span class="org-keyword">trait</span> <span class="org-type">Foo</span> {
    <span class="org-keyword">abstract</span> <span class="org-keyword">function</span> <span class="org-function-name">getText</span>(): <span class="org-warning">string</span>;
    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">output</span>() {
        <span class="org-keyword">echo</span> $<span class="org-constant">this</span>-&gt;<span class="org-function-name">getText</span>();
    }
}

<span class="org-keyword">class</span> <span class="org-type">Bar</span> {
    <span class="org-keyword">use</span> <span class="org-type">Foo</span>;
    <span class="org-keyword">private</span> <span class="org-keyword">function</span> <span class="org-function-name">getText</span>(): <span class="org-warning">string</span> {
        <span class="org-keyword">return</span> <span class="org-string">'text'</span>;
    }
}

$<span class="org-variable-name">bar</span>= <span class="org-keyword">new</span> <span class="org-type">Bar</span>();
$<span class="org-variable-name">bar</span>-&gt;<span class="org-function-name">output</span>(); <span class="org-comment-delimiter">// </span><span class="org-comment">text</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7-9-6" class="outline-4">
<h4 id="sec-7-9-6"><span class="section-number-4">7.9.6</span> 示例</h4>
<div class="outline-text-4" id="text-7-9-6">
<div class="org-src-container">

<pre class="src src-php"><span class="org-keyword">trait</span> <span class="org-type">Logger</span> {
    <span class="org-keyword">private</span> $<span class="org-variable-name">logFile</span>;
    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">logError</span>(<span class="org-type">string</span> $<span class="org-variable-name">msg</span> = <span class="org-string">'unknown'</span>) {
        <span class="org-keyword">echo</span> <span class="org-string">'[file='</span> . $<span class="org-constant">this</span>-&gt;<span class="org-variable-name">logFile</span> . <span class="org-string">'] [msg='</span> . $<span class="org-variable-name">msg</span> . <span class="org-string">']'</span>;
    }
}

<span class="org-keyword">class</span> <span class="org-type">Foo</span> {
    <span class="org-keyword">use</span> <span class="org-type">Logger</span>;
    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">__construct</span>() {
        $<span class="org-constant">this</span>-&gt;<span class="org-variable-name">logFile</span> = <span class="org-string">'foo.log'</span>;
    }
}

<span class="org-keyword">class</span> <span class="org-type">Bar</span> {
    <span class="org-keyword">use</span> <span class="org-type">Logger</span>;
    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">__construct</span>() {
        $<span class="org-constant">this</span>-&gt;<span class="org-variable-name">logFile</span> = <span class="org-string">'bar.log'</span>;
    }
}

$<span class="org-variable-name">foo</span> = <span class="org-keyword">new</span> <span class="org-type">Foo</span>();
$<span class="org-variable-name">foo</span>-&gt;<span class="org-function-name">logError</span>(); <span class="org-comment-delimiter">// </span><span class="org-comment">[file=foo.log] [msg=unknown]</span>
$<span class="org-variable-name">bar</span> = <span class="org-keyword">new</span> <span class="org-type">Bar</span>();
$<span class="org-variable-name">bar</span>-&gt;<span class="org-function-name">logError</span>(); <span class="org-comment-delimiter">// </span><span class="org-comment">[file=bar.log] [msg=unknown]</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-7-10" class="outline-3">
<h3 id="sec-7-10"><span class="section-number-3">7.10</span> <code>::</code> 运算符</h3>
<div class="outline-text-3" id="text-7-10">
<p>
在类而不是对象上下文中引用方法时，使用 <code>::</code> 而不是 <code>-&gt;</code> 。
</p>
</div>

<div id="outline-container-sec-7-10-1" class="outline-4">
<h4 id="sec-7-10-1"><span class="section-number-4">7.10.1</span> <code>parent</code></h4>
<div class="outline-text-4" id="text-7-10-1">
<p>
<code>parent::&lt;method&gt;()</code> 是唯一可以用静态语法调用非静态方法的场合。
</p>

<div class="org-src-container">

<pre class="src src-php"><span class="org-keyword">class</span> <span class="org-type">Foo</span> {
    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">__construct</span>() {}
}
<span class="org-keyword">class</span> <span class="org-type">Bar</span> <span class="org-keyword">extends</span> <span class="org-type">Foo</span> {
    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">__construct</span>() {
        <span class="org-constant">parent</span>::<span class="org-function-name">__construct</span>();
        <span class="org-comment-delimiter">// </span><span class="org-comment">...</span>
    }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7-10-2" class="outline-4">
<h4 id="sec-7-10-2"><span class="section-number-4">7.10.2</span> <code>self</code></h4>
<div class="outline-text-4" id="text-7-10-2">
<p>
类的 <code>self</code> 相当于对象的 <code>$this</code> 。
</p>

<div class="org-src-container">

<pre class="src src-php"><span class="org-keyword">class</span> <span class="org-type">Foo</span> {
    <span class="org-keyword">protected</span> <span class="org-keyword">static</span> $<span class="org-variable-name">counter</span> = <span class="org-default">0</span>;
    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-keyword">function</span> <span class="org-function-name">visit</span>() {
        <span class="org-constant">self</span>::$<span class="org-variable-name">counter</span>++;
    }
    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-keyword">function</span> <span class="org-function-name">create</span>() {
        <span class="org-keyword">return</span> <span class="org-keyword">new</span> <span class="org-type">self</span>();
    }
}
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><code>self</code> 得解析不依赖于调用时的上下文，而是定义位置。</label>
<pre class="src src-php"><span class="org-keyword">abstract</span> <span class="org-keyword">class</span> <span class="org-type">Foo</span> {
    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-keyword">function</span> <span class="org-function-name">create</span>() {
        <span class="org-keyword">return</span> <span class="org-keyword">new</span> <span class="org-type">self</span>(); <span class="org-comment-delimiter">// </span><span class="org-comment">self == Foo</span>
    }
}
<span class="org-keyword">class</span> <span class="org-type">Bar</span> <span class="org-keyword">extends</span> <span class="org-type">Foo</span> {}
$<span class="org-variable-name">bar</span> = <span class="org-type">Bar</span>::<span class="org-function-name">create</span>();
<span class="org-comment-delimiter">// </span><span class="org-comment">Fatal error: Uncaught Error: Cannot instantiate abstract class Foo ...</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7-10-3" class="outline-4">
<h4 id="sec-7-10-3"><span class="section-number-4">7.10.3</span> <code>static</code></h4>
<div class="outline-text-4" id="text-7-10-3">
<p>
PHP 5.3 引入 late static binding，以解决基类中 <code>self</code> 无法解析为子类的问题。
</p>

<div class="org-src-container">

<pre class="src src-php"><span class="org-keyword">abstract</span> <span class="org-keyword">class</span> <span class="org-type">Foo</span> {
    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-keyword">function</span> <span class="org-function-name">create</span>() {
        <span class="org-keyword">return</span> <span class="org-keyword">new</span> <span class="org-keyword">static</span>(); <span class="org-comment-delimiter">// </span><span class="org-comment">static == &#35843;&#29992;&#26102;&#30340;&#31867;</span>
    }
    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">output</span>() {
        <span class="org-keyword">echo</span> <span class="org-constant">static</span>::<span class="org-function-name">getName</span>(); <span class="org-comment-delimiter">// </span><span class="org-comment">static &#21487;&#20197;&#22312;&#38750;&#38745;&#24577;&#19978;&#19979;&#25991;&#20013;&#65292;&#20197;&#38745;&#24577;&#35821;&#27861;&#35843;&#29992;&#38745;&#24577;&#25110;&#38750;&#38745;&#24577;&#26041;&#27861;</span>
    }
}
<span class="org-keyword">class</span> <span class="org-type">Bar</span> <span class="org-keyword">extends</span> <span class="org-type">Foo</span> {
    <span class="org-keyword">public</span> $<span class="org-variable-name">name</span> = <span class="org-string">'Bar'</span>;
    <span class="org-keyword">protected</span> <span class="org-keyword">function</span> <span class="org-function-name">getName</span>() {
        <span class="org-keyword">return</span> $<span class="org-constant">this</span>-&gt;<span class="org-variable-name">name</span>;
    }
}
$<span class="org-variable-name">bar</span> = <span class="org-type">Bar</span>::<span class="org-function-name">create</span>();
<span class="org-keyword">echo</span> <span class="org-function-name">get_class</span>($<span class="org-variable-name">bar</span>); <span class="org-comment-delimiter">// </span><span class="org-comment">Bar</span>
$<span class="org-variable-name">bar</span>-&gt;<span class="org-function-name">output</span>();       <span class="org-comment-delimiter">// </span><span class="org-comment">Bar</span>
</pre>
</div>
</div>
</div>
