programming/php/php.org
*** =class=

=<class_name>::class= 表示类的 fully qualified 类名， =<class_name>= 可以是类的别名。

#+begin_src php
namespace Foo;
class Bar {}
Bar::class; // Foo\Bar
#+end_src

** =clone=

PHP 5 之后对象赋值为传递引用，使用 =clone= 可以显式复制对象，此时会在副本对象上调用 =__clone()= 方法。使用 =__clone()= 方法可以解决以下问题：

- 对象属性中包含标识符，如 ID 时， =clone= 对象默认会与原对象指向同一个数据源记录的问题。
- 对象属性中包含对象， =clone= 对象默认复制属性对象的引用。

#+begin_src php
class Foo {
    private $id;
    public $name;
    public $bar;
    public function __construct($name, Bar $bar) {
        $this->name = $name;
        $this->bar = $bar;
    }
    public function __clone() {
        $this->id = 0; // 重置 ID，避免指向同一条记录
        $this->name = 'This is a clone of ' . $this->name;
        $this->bar = clone $this->bar; // 复制属性对象
    }
}

$a = new Foo('bar');
$b = clone $a;
echo $b->name; // This is a clone of bar
#+end_src

* 错误
** 错误等级

|       |                    |                       |                                              | 产生者            | 示例                       |
|-------+--------------------+-----------------------+----------------------------------------------+-------------------+----------------------------|
|     1 | =---------------1= | =E_ERROR=             | 运行时致命错误，程序停止运行                 |                   | 一个对象调用一个不存在的类 |
|-------+--------------------+-----------------------+----------------------------------------------+-------------------+----------------------------|
|     2 | =--------------1-= | =E_WARNING=           | 运行时警告（非致命错误），程序不会停止       |                   | 使用了未定义的包的功能     |
|-------+--------------------+-----------------------+----------------------------------------------+-------------------+----------------------------|
|     4 | =-------------1--= | =E_PARSE=             | 编译时解析错误                               | 解析器            |                            |
|-------+--------------------+-----------------------+----------------------------------------------+-------------------+----------------------------|
|     8 | =------------1---= | =E_NOTICE=            | 运行时提示                                   |                   | 使用了未声明变量           |
|       |                    |                       | 代码执行有可能造成问题，程序不会停止         |                   |                            |
|-------+--------------------+-----------------------+----------------------------------------------+-------------------+----------------------------|
|    16 | =-----------1----= | =E_CORE_ERROR=        | PHP 启动时的致命错误                         | PHP 核心          |                            |
|-------+--------------------+-----------------------+----------------------------------------------+-------------------+----------------------------|
|    32 | =----------1-----= | =E_CORE_WARNING=      | PHP 启动时的警告（非致命错误）               | PHP 核心          |                            |
|-------+--------------------+-----------------------+----------------------------------------------+-------------------+----------------------------|
|    64 | =---------1------= | =E_COMPILE_ERROR=     | 编译时致命错误                               | Zend 脚本引擎     |                            |
|-------+--------------------+-----------------------+----------------------------------------------+-------------------+----------------------------|
|   128 | =--------1-------= | =E_COMPILE_WARNING=   | 编译时警告（非致命错误）                     | Zend 脚本引擎     |                            |
|-------+--------------------+-----------------------+----------------------------------------------+-------------------+----------------------------|
|   256 | =-------1--------= | =E_USER_ERROR=        | 用户生成的错误信息                           | =trigger_error()= |                            |
|-------+--------------------+-----------------------+----------------------------------------------+-------------------+----------------------------|
|   512 | =------1---------= | =E_USER_WARNING=      | 用户生成的警告信息                           | =trigger_error()= |                            |
|-------+--------------------+-----------------------+----------------------------------------------+-------------------+----------------------------|
|  1024 | =-----1----------= | =E_USER_NOTICE=       | 用户生成的提示信息                           | =trigger_error()= |                            |
|-------+--------------------+-----------------------+----------------------------------------------+-------------------+----------------------------|
|  2048 | =----1-----------= | =E_STRICT=            | 对代码互操作性和向后兼容性的建议             |                   |                            |
|-------+--------------------+-----------------------+----------------------------------------------+-------------------+----------------------------|
|  4096 | =---1------------= | =E_RECOVERABLE_ERROR= | 可捕获的致命错误                             |                   |                            |
|       |                    |                       | 如果没有被错误处理函数捕获，则产生 =E_ERROR= |                   |                            |
|-------+--------------------+-----------------------+----------------------------------------------+-------------------+----------------------------|
|  8192 | =--1-------------= | =E_DEPRECATED=        | 运行时提示，在未来版本中无法使用的代码       |                   |                            |
|-------+--------------------+-----------------------+----------------------------------------------+-------------------+----------------------------|
| 16384 | =-1--------------= | =E_USER_DEPRECATED=   | 用户生成的警告信息                           | =trigger_error()= |                            |
|-------+--------------------+-----------------------+----------------------------------------------+-------------------+----------------------------|
| 32767 | =-111111111111111= | =E_ALL=               | 以上全部错误、警告、提示                     |                   |                            |

设定错误报告等级的方式：

- =php.ini= 的 =error_reporting= 指令
- =error_reporting()=

