programming/php/php.html
<div id="outline-container-sec-7-10-4" class="outline-4">
<h4 id="sec-7-10-4"><span class="section-number-4">7.10.4</span> <code>class</code></h4>
<div class="outline-text-4" id="text-7-10-4">
<p>
<code>&lt;class_name&gt;::class</code> 表示类的 fully qualified 类名， <code>&lt;class_name&gt;</code> 可以是类的别名。
</p>

<div class="org-src-container">

<pre class="src src-php"><span class="org-keyword">namespace</span> <span class="org-type">Foo</span>;
<span class="org-keyword">class</span> <span class="org-type">Bar</span> {}
<span class="org-type">Bar</span>::<span class="org-constant">class</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">Foo\Bar</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-7-11" class="outline-3">
<h3 id="sec-7-11"><span class="section-number-3">7.11</span> <code>clone</code></h3>
<div class="outline-text-3" id="text-7-11">
<p>
PHP 5 之后对象赋值为传递引用，使用 <code>clone</code> 可以显式复制对象，此时会在副本对象上调用 <code>__clone()</code> 方法。使用 <code>__clone()</code> 方法可以解决以下问题：
</p>

<ul class="org-ul">
<li>对象属性中包含标识符，如 ID 时， <code>clone</code> 对象默认会与原对象指向同一个数据源记录的问题。
</li>
<li>对象属性中包含对象， <code>clone</code> 对象默认复制属性对象的引用。
</li>
</ul>

<div class="org-src-container">

<pre class="src src-php"><span class="org-keyword">class</span> <span class="org-type">Foo</span> {
    <span class="org-keyword">private</span> $<span class="org-variable-name">id</span>;
    <span class="org-keyword">public</span> $<span class="org-variable-name">name</span>;
    <span class="org-keyword">public</span> $<span class="org-variable-name">bar</span>;
    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">__construct</span>($<span class="org-variable-name">name</span>, <span class="org-type">Bar</span> $<span class="org-variable-name">bar</span>) {
        $<span class="org-constant">this</span>-&gt;<span class="org-variable-name">name</span> = $<span class="org-variable-name">name</span>;
        $<span class="org-constant">this</span>-&gt;<span class="org-variable-name">bar</span> = $<span class="org-variable-name">bar</span>;
    }
    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">__clone</span>() {
        $<span class="org-constant">this</span>-&gt;<span class="org-variable-name">id</span> = <span class="org-default">0</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">&#37325;&#32622; ID&#65292;&#36991;&#20813;&#25351;&#21521;&#21516;&#19968;&#26465;&#35760;&#24405;</span>
        $<span class="org-constant">this</span>-&gt;<span class="org-variable-name">name</span> = <span class="org-string">'This is a clone of '</span> . $<span class="org-constant">this</span>-&gt;<span class="org-variable-name">name</span>;
        $<span class="org-constant">this</span>-&gt;<span class="org-variable-name">bar</span> = <span class="org-keyword">clone</span> $<span class="org-constant">this</span>-&gt;<span class="org-variable-name">bar</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">&#22797;&#21046;&#23646;&#24615;&#23545;&#35937;</span>
    }
}

$<span class="org-variable-name">a</span> = <span class="org-keyword">new</span> <span class="org-type">Foo</span>(<span class="org-string">'bar'</span>);
$<span class="org-variable-name">b</span> = <span class="org-keyword">clone</span> $<span class="org-variable-name">a</span>;
<span class="org-keyword">echo</span> $<span class="org-variable-name">b</span>-&gt;<span class="org-variable-name">name</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">This is a clone of bar</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> 错误</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> 错误等级</h3>
<div class="outline-text-3" id="text-8-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">产生者</th>
<th scope="col" class="left">示例</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">1</td>
<td class="left"><code>---------------1</code></td>
<td class="left"><code>E_ERROR</code></td>
<td class="left">运行时致命错误，程序停止运行</td>
<td class="left">&#xa0;</td>
<td class="left">一个对象调用一个不存在的类</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">2</td>
<td class="left"><code>--------------1-</code></td>
<td class="left"><code>E_WARNING</code></td>
<td class="left">运行时警告（非致命错误），程序不会停止</td>
<td class="left">&#xa0;</td>
<td class="left">使用了未定义的包的功能</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">4</td>
<td class="left"><code>-------------1--</code></td>
<td class="left"><code>E_PARSE</code></td>
<td class="left">编译时解析错误</td>
<td class="left">解析器</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">8</td>
<td class="left"><code>------------1---</code></td>
<td class="left"><code>E_NOTICE</code></td>
<td class="left">运行时提示</td>
<td class="left">&#xa0;</td>
<td class="left">使用了未声明变量</td>
</tr>

<tr>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">代码执行有可能造成问题，程序不会停止</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">16</td>
<td class="left"><code>-----------1----</code></td>
<td class="left"><code>E_CORE_ERROR</code></td>
<td class="left">PHP 启动时的致命错误</td>
<td class="left">PHP 核心</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">32</td>
<td class="left"><code>----------1-----</code></td>
<td class="left"><code>E_CORE_WARNING</code></td>
<td class="left">PHP 启动时的警告（非致命错误）</td>
<td class="left">PHP 核心</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">64</td>
<td class="left"><code>---------1------</code></td>
<td class="left"><code>E_COMPILE_ERROR</code></td>
<td class="left">编译时致命错误</td>
<td class="left">Zend 脚本引擎</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">128</td>
<td class="left"><code>--------1-------</code></td>
<td class="left"><code>E_COMPILE_WARNING</code></td>
<td class="left">编译时警告（非致命错误）</td>
<td class="left">Zend 脚本引擎</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">256</td>
<td class="left"><code>-------1--------</code></td>
<td class="left"><code>E_USER_ERROR</code></td>
<td class="left">用户生成的错误信息</td>
<td class="left"><code>trigger_error()</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">512</td>
<td class="left"><code>------1---------</code></td>
<td class="left"><code>E_USER_WARNING</code></td>
<td class="left">用户生成的警告信息</td>
<td class="left"><code>trigger_error()</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">1024</td>
<td class="left"><code>-----1----------</code></td>
<td class="left"><code>E_USER_NOTICE</code></td>
<td class="left">用户生成的提示信息</td>
<td class="left"><code>trigger_error()</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">2048</td>
<td class="left"><code>----1-----------</code></td>
<td class="left"><code>E_STRICT</code></td>
<td class="left">对代码互操作性和向后兼容性的建议</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">4096</td>
<td class="left"><code>---1------------</code></td>
<td class="left"><code>E_RECOVERABLE_ERROR</code></td>
<td class="left">可捕获的致命错误</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">如果没有被错误处理函数捕获，则产生 <code>E_ERROR</code></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">8192</td>
<td class="left"><code>--1-------------</code></td>
<td class="left"><code>E_DEPRECATED</code></td>
<td class="left">运行时提示，在未来版本中无法使用的代码</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">16384</td>
<td class="left"><code>-1--------------</code></td>
<td class="left"><code>E_USER_DEPRECATED</code></td>
<td class="left">用户生成的警告信息</td>
<td class="left"><code>trigger_error()</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">32767</td>
<td class="left"><code>-111111111111111</code></td>
<td class="left"><code>E_ALL</code></td>
<td class="left">以上全部错误、警告、提示</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
设定错误报告等级的方式：
</p>

<ul class="org-ul">
<li><code>php.ini</code> 的 <code>error_reporting</code> 指令
</li>
<li><code>error_reporting()</code>
</li>
</ul>
</div>
</div>
