programming/php/php.org
** 配置

#+caption: 显示错误
#+begin_src php
error_reporting(E_ALL & ~E_STRICT & ~E_NOTICE);
ini_set('display_errors', '1');
#+end_src

#+caption: 记录错误日志
#+begin_src php
error_reporting(E_ALL & ~E_STRICT & ~E_NOTICE);
ini_set('log_errors', '1');
ini_set('error_log', 'path/to/file');
#+end_src

** =@=

#+begin_src php
@<expr>
#+end_src

忽略表达式可能产生的错误信息。如果启动了 =track_errors= 选项，错误信息会保存在 =$php_errormsg= 中。

#+begin_src php
$foo = @(57/0);
$bar = @file('file_name') or die('Failed opening file');
#+end_src

** =Error= 类

PHP 7 加入 =Error= 类，实现 =Throwable= 接口，使内部错误可以像代码错误一样被捕获。

| =ArithmeticError=     | 数学运算错误                     |
|-----------------------+----------------------------------|
| =AssertionError=      | =assert()= 错误                  |
|-----------------------+----------------------------------|
| =DivisionByZeroError= |                                  |
|-----------------------+----------------------------------|
| =ParseError=          | 运行时 PHP 解析错误，如 =eval()= |
|-----------------------+----------------------------------|
| =TypeError=           | 参数、返回值类型错误             |

#+begin_src php
function foo(int $arg) {}
try {
    foo('bar');
} catch (Error $e) {
    echo $e->getMessage(); // Argument 1 passed to foo() must be of the type integer, string given ...
}
#+end_src

* 异常

当代码运行中发现错误，而没有如何处理错误的上下文信息时，应当抛出异常，将错误处理交给客户代码。

#+begin_src php
try {
    throw new Exception();
    // 如果抛出异常，之后的代码不被执行
} catch(FooException $e) {
    // 只执行第一个与异常类型匹配的捕获代码
} catch(Exception $e) {
    throw new Exception(); // 再次抛出异常
} finally {
    // 执行：抛出异常时，包括捕获后再次抛出异常或返回时
    // 不执行：try 或 catch 中执行了 die() 或 exit() 时
}
#+end_src

未被捕获的异常会被隐式地再次抛出，直到异常被捕获，或无法继续抛出并导致错误。

#+begin_src php
function foo() {
    throw new Exception();
}
foo(); // Fatal error: Uncaught Exception ...
#+end_src

** 自定义异常

#+begin_src php
class OpenFileException extends Exception {
    function open() {
        touch("tmp.txt");
        $file = fopen("tmp.txt", "r");
        return $file;
    }
}

class MyClass {
    function openfile() {
        $file = @fopen("non-exist.txt", "r");
        if (!$file) {
            throw new OpenFileException("文件打开失败");
        }
    }
}

try {
    $my = new MyClass();
    $my->openfile();
} catch (OpenFileException $e) {
    echo $e->getMessage() . "<br />";
    $file = $e->open();
} catch (Exception $e) {  //接收没有处理的所有异常
    echo $e->getMessage();
}
#+end_src

* 配置
** 可设定范围

|                  | 可设定的位置                  |
|------------------+-------------------------------|
| =PHP_INI_ALL=    | 任何地方                      |
|------------------+-------------------------------|
| =PHP_INI_SYSTEM= | =php.ini=                     |
|                  | =httpd.conf=                  |
|------------------+-------------------------------|
| =PHP_INI_PERDIR= | =php.ini=                     |
|                  | =httpd.conf=                  |
|                  | =.htaccess=                   |
|------------------+-------------------------------|
| =PHP_INI_USER=   | PHP 脚本（使用 =ini_set()= ） |
|                  | =.user.ini=                   |

