programming/php/php.html
<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> 配置</h3>
<div class="outline-text-3" id="text-8-2">
<div class="org-src-container">
<label class="org-src-name">显示错误</label>
<pre class="src src-php"><span class="org-function-name">error_reporting</span>(<span class="org-constant">E_ALL</span> &amp; ~<span class="org-constant">E_STRICT</span> &amp; ~<span class="org-constant">E_NOTICE</span>);
<span class="org-function-name">ini_set</span>(<span class="org-string">'display_errors'</span>, <span class="org-string">'1'</span>);
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">记录错误日志</label>
<pre class="src src-php"><span class="org-function-name">error_reporting</span>(<span class="org-constant">E_ALL</span> &amp; ~<span class="org-constant">E_STRICT</span> &amp; ~<span class="org-constant">E_NOTICE</span>);
<span class="org-function-name">ini_set</span>(<span class="org-string">'log_errors'</span>, <span class="org-string">'1'</span>);
<span class="org-function-name">ini_set</span>(<span class="org-string">'error_log'</span>, <span class="org-string">'path/to/file'</span>);
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8-3" class="outline-3">
<h3 id="sec-8-3"><span class="section-number-3">8.3</span> <code>@</code></h3>
<div class="outline-text-3" id="text-8-3">
<div class="org-src-container">

<pre class="src src-php">@<span class="org-constant">&lt;expr&gt;</span>
</pre>
</div>

<p>
忽略表达式可能产生的错误信息。如果启动了 <code>track_errors</code> 选项，错误信息会保存在 <code>$php_errormsg</code> 中。
</p>

<div class="org-src-container">

<pre class="src src-php">$<span class="org-variable-name">foo</span> = @(<span class="org-default">57</span>/<span class="org-default">0</span>);
$<span class="org-variable-name">bar</span> = @<span class="org-function-name">file</span>(<span class="org-string">'file_name'</span>) <span class="org-keyword">or</span> <span class="org-keyword">die</span>(<span class="org-string">'Failed opening file'</span>);
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8-4" class="outline-3">
<h3 id="sec-8-4"><span class="section-number-3">8.4</span> <code>Error</code> 类</h3>
<div class="outline-text-3" id="text-8-4">
<p>
PHP 7 加入 <code>Error</code> 类，实现 <code>Throwable</code> 接口，使内部错误可以像代码错误一样被捕获。
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><code>ArithmeticError</code></th>
<th scope="col" class="left">数学运算错误</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>AssertionError</code></td>
<td class="left"><code>assert()</code> 错误</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>DivisionByZeroError</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>ParseError</code></td>
<td class="left">运行时 PHP 解析错误，如 <code>eval()</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>TypeError</code></td>
<td class="left">参数、返回值类型错误</td>
</tr>
</tbody>
</table>

<div class="org-src-container">

<pre class="src src-php"><span class="org-keyword">function</span> <span class="org-function-name">foo</span>(<span class="org-type">int</span> $<span class="org-variable-name">arg</span>) {}
<span class="org-keyword">try</span> {
    <span class="org-function-name">foo</span>(<span class="org-string">'bar'</span>);
} <span class="org-keyword">catch</span> (<span class="org-type">Error</span> $<span class="org-variable-name">e</span>) {
    <span class="org-keyword">echo</span> $<span class="org-variable-name">e</span>-&gt;<span class="org-function-name">getMessage</span>(); <span class="org-comment-delimiter">// </span><span class="org-comment">Argument 1 passed to foo() must be of the type integer, string given ...</span>
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> 异常</h2>
<div class="outline-text-2" id="text-9">
<p>
当代码运行中发现错误，而没有如何处理错误的上下文信息时，应当抛出异常，将错误处理交给客户代码。
</p>

<div class="org-src-container">

<pre class="src src-php"><span class="org-keyword">try</span> {
    <span class="org-keyword">throw</span> <span class="org-keyword">new</span> <span class="org-type">Exception</span>();
    <span class="org-comment-delimiter">// </span><span class="org-comment">&#22914;&#26524;&#25243;&#20986;&#24322;&#24120;&#65292;&#20043;&#21518;&#30340;&#20195;&#30721;&#19981;&#34987;&#25191;&#34892;</span>
} <span class="org-keyword">catch</span>(<span class="org-type">FooException</span> $<span class="org-variable-name">e</span>) {
    <span class="org-comment-delimiter">// </span><span class="org-comment">&#21482;&#25191;&#34892;&#31532;&#19968;&#20010;&#19982;&#24322;&#24120;&#31867;&#22411;&#21305;&#37197;&#30340;&#25429;&#33719;&#20195;&#30721;</span>
} <span class="org-keyword">catch</span>(<span class="org-type">Exception</span> $<span class="org-variable-name">e</span>) {
    <span class="org-keyword">throw</span> <span class="org-keyword">new</span> <span class="org-type">Exception</span>(); <span class="org-comment-delimiter">// </span><span class="org-comment">&#20877;&#27425;&#25243;&#20986;&#24322;&#24120;</span>
} <span class="org-keyword">finally</span> {
    <span class="org-comment-delimiter">// </span><span class="org-comment">&#25191;&#34892;&#65306;&#25243;&#20986;&#24322;&#24120;&#26102;&#65292;&#21253;&#25324;&#25429;&#33719;&#21518;&#20877;&#27425;&#25243;&#20986;&#24322;&#24120;&#25110;&#36820;&#22238;&#26102;</span>
    <span class="org-comment-delimiter">// </span><span class="org-comment">&#19981;&#25191;&#34892;&#65306;try &#25110; catch &#20013;&#25191;&#34892;&#20102; die() &#25110; exit() &#26102;</span>
}
</pre>
</div>

<p>
未被捕获的异常会被隐式地再次抛出，直到异常被捕获，或无法继续抛出并导致错误。
</p>

<div class="org-src-container">

<pre class="src src-php"><span class="org-keyword">function</span> <span class="org-function-name">foo</span>() {
    <span class="org-keyword">throw</span> <span class="org-keyword">new</span> <span class="org-type">Exception</span>();
}
<span class="org-function-name">foo</span>(); <span class="org-comment-delimiter">// </span><span class="org-comment">Fatal error: Uncaught Exception ...</span>
</pre>
</div>
</div>

<div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> 自定义异常</h3>
<div class="outline-text-3" id="text-9-1">
<div class="org-src-container">

<pre class="src src-php"><span class="org-keyword">class</span> <span class="org-type">OpenFileException</span> <span class="org-keyword">extends</span> <span class="org-type">Exception</span> {
    <span class="org-keyword">function</span> <span class="org-function-name">open</span>() {
        <span class="org-function-name">touch</span>(<span class="org-string">"tmp.txt"</span>);
        $<span class="org-variable-name">file</span> = <span class="org-function-name">fopen</span>(<span class="org-string">"tmp.txt"</span>, <span class="org-string">"r"</span>);
        <span class="org-keyword">return</span> $<span class="org-variable-name">file</span>;
    }
}

<span class="org-keyword">class</span> <span class="org-type">MyClass</span> {
    <span class="org-keyword">function</span> <span class="org-function-name">openfile</span>() {
        $<span class="org-variable-name">file</span> = @<span class="org-function-name">fopen</span>(<span class="org-string">"non-exist.txt"</span>, <span class="org-string">"r"</span>);
        <span class="org-keyword">if</span> (!$<span class="org-variable-name">file</span>) {
            <span class="org-keyword">throw</span> <span class="org-keyword">new</span> <span class="org-type">OpenFileException</span>(<span class="org-string">"&#25991;&#20214;&#25171;&#24320;&#22833;&#36133;"</span>);
        }
    }
}

<span class="org-keyword">try</span> {
    $<span class="org-variable-name">my</span> = <span class="org-keyword">new</span> <span class="org-type">MyClass</span>();
    $<span class="org-variable-name">my</span>-&gt;<span class="org-function-name">openfile</span>();
} <span class="org-keyword">catch</span> (<span class="org-type">OpenFileException</span> $<span class="org-variable-name">e</span>) {
    <span class="org-keyword">echo</span> $<span class="org-variable-name">e</span>-&gt;<span class="org-function-name">getMessage</span>() . <span class="org-string">"&lt;br /&gt;"</span>;
    $<span class="org-variable-name">file</span> = $<span class="org-variable-name">e</span>-&gt;<span class="org-function-name">open</span>();
} <span class="org-keyword">catch</span> (<span class="org-type">Exception</span> $<span class="org-variable-name">e</span>) {  <span class="org-comment-delimiter">//</span><span class="org-comment">&#25509;&#25910;&#27809;&#26377;&#22788;&#29702;&#30340;&#25152;&#26377;&#24322;&#24120;</span>
    <span class="org-keyword">echo</span> $<span class="org-variable-name">e</span>-&gt;<span class="org-function-name">getMessage</span>();
}
</pre>
</div>
</div>
</div>
</div>
