programming/php/php.org
** 错误处理

|                          |                                   | 类型      | 默认值 | 可设定范围    |
|--------------------------+-----------------------------------+-----------+--------+---------------|
| =error_reporting=        | 错误报告级别                      | =int=     | =null= | =PHP_INI_ALL= |
|--------------------------+-----------------------------------+-----------+--------+---------------|
| =display_errors=         | 是否打印错误输出                  | =string=  | =1=    | =PHP_INI_ALL= |
|--------------------------+-----------------------------------+-----------+--------+---------------|
| =display_startup_errors= | 是否打印 PHP 启动过程中的错误输出 | =boolean= | =0=    | =PHP_INI_ALL= |
|--------------------------+-----------------------------------+-----------+--------+---------------|
| =log_errors=             | 是否将脚本错误信息输出到日志文件  | =boolean= | =0=    | =PHP_INI_ALL= |
|--------------------------+-----------------------------------+-----------+--------+---------------|
| =error_log=              | 错误日志文件路径                  | =string=  | =null= | =PHP_INI_ALL= |

#+caption: 示例
#+begin_src php
ini_set('display_errors', '0');
ini_set('log_errors', '1');
ini_set('error_log', ROOT . '/log/error.log');
#+end_src

** 文件上传

|                       |                                                    | 类型   | 默认值 |
|-----------------------+----------------------------------------------------+--------+--------|
| =file_uploads=        | 是否允许 HTTP 上传文件                             | int    | =1=    |
|-----------------------+----------------------------------------------------+--------+--------|
| =upload_tmp_dir=      | 存放上传文件的临时文件夹，必须是可写的             | string | =NULL= |
|                       | 若为 null 或文件夹不可写，则使用系统默认临时文件夹 |        |        |
|-----------------------+----------------------------------------------------+--------+--------|
| =upload_max_filesize= | 上传文件的最大字节数                               | int    |        |
|-----------------------+----------------------------------------------------+--------+--------|
| =max_file_uploads=    | 允许同时上传文件的数量                             | int    |        |

** 路径和目录

|                |                                                                                | 类型   | 默认值                | 可设定范围    |
|----------------+--------------------------------------------------------------------------------+--------+-----------------------+---------------|
| =include_path= | 用于查找使用相对路径的文件的目录列表，类似 =PATH= 环境变量                     | string | =.;/path/to/php/pear= | =PHP_INI_ALL= |
|                | 用于 =require= =include= =fopen()= =file()= =readfile()= =file_get_contents()= |        |                       |               |
|                | 可以使用 =set_include_path()= 进行设定                                         |        |                       |               |

** 安全模式

|             |                                                             | 类型 | 默认值 | 可设定范围       |
|-------------+-------------------------------------------------------------+------+--------+------------------|
| =safe_mode= | 安全模式，主要影响文件操作                                  | int  | =0=    | =PHP_INI_SYSTEM= |
|             | PHP 会检查当前脚本的拥有者和被操作文件的拥有者是否一致      |      |        |                  |
|             | 受影响的函数： =pathinfo()= =basename()= =fopen()= =exec()= |      |        |                  |

** 扩展控制

|                 |                              | 类型   | 默认值         | 可设定范围       |
|-----------------+------------------------------+--------+----------------+------------------|
| =extension=     | 控制扩展的开闭               | string | =NULL=         | =php.ini=        |
|                 | e.g. =extension=php_pdo.dll= |        |                |                  |
|-----------------+------------------------------+--------+----------------+------------------|
| =extension_dir= | 动态加载扩展的目录           | string | =/path/to/php= | =PHP_INI_SYSTEM= |

* 环境
** 环境变量

#+caption: Apache 设置环境变量
#+begin_src sh
<VirtualHost ...>
    SetEnv <NAME> "<value>"
</VirtualHost>
#+end_src

#+caption: Nginx 设置环境变量
#+begin_src sh
# fastcgi_params 文件
fastcgi_param <NAME> '<value>';

# nginx.conf 文件
server {
    include fastcgi_params;
}
#+end_src

#+caption: PHP 读取环境变量
#+begin_src php
$var = getenv('NAME');
#+end_src

* 高级
** 命名空间

PHP 5.3 引入命名空间，通过为一组类、接口、函数、常量加上共同的前缀，避免名称冲突（name collision）。

