programming/php/php.html
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> 配置</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1"><span class="section-number-3">10.1</span> 可设定范围</h3>
<div class="outline-text-3" id="text-10-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">可设定的位置</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>PHP_INI_ALL</code></td>
<td class="left">任何地方</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>PHP_INI_SYSTEM</code></td>
<td class="left"><code>php.ini</code></td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>httpd.conf</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>PHP_INI_PERDIR</code></td>
<td class="left"><code>php.ini</code></td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>httpd.conf</code></td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>.htaccess</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>PHP_INI_USER</code></td>
<td class="left">PHP 脚本（使用 <code>ini_set()</code> ）</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>.user.ini</code></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-10-2" class="outline-3">
<h3 id="sec-10-2"><span class="section-number-3">10.2</span> 错误处理</h3>
<div class="outline-text-3" id="text-10-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">类型</th>
<th scope="col" class="left">默认值</th>
<th scope="col" class="left">可设定范围</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>error_reporting</code></td>
<td class="left">错误报告级别</td>
<td class="left"><code>int</code></td>
<td class="left"><code>null</code></td>
<td class="left"><code>PHP_INI_ALL</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>display_errors</code></td>
<td class="left">是否打印错误输出</td>
<td class="left"><code>string</code></td>
<td class="left"><code>1</code></td>
<td class="left"><code>PHP_INI_ALL</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>display_startup_errors</code></td>
<td class="left">是否打印 PHP 启动过程中的错误输出</td>
<td class="left"><code>boolean</code></td>
<td class="left"><code>0</code></td>
<td class="left"><code>PHP_INI_ALL</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>log_errors</code></td>
<td class="left">是否将脚本错误信息输出到日志文件</td>
<td class="left"><code>boolean</code></td>
<td class="left"><code>0</code></td>
<td class="left"><code>PHP_INI_ALL</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>error_log</code></td>
<td class="left">错误日志文件路径</td>
<td class="left"><code>string</code></td>
<td class="left"><code>null</code></td>
<td class="left"><code>PHP_INI_ALL</code></td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<label class="org-src-name">示例</label>
<pre class="src src-php"><span class="org-function-name">ini_set</span>(<span class="org-string">'display_errors'</span>, <span class="org-string">'0'</span>);
<span class="org-function-name">ini_set</span>(<span class="org-string">'log_errors'</span>, <span class="org-string">'1'</span>);
<span class="org-function-name">ini_set</span>(<span class="org-string">'error_log'</span>, <span class="org-constant">ROOT</span> . <span class="org-string">'/log/error.log'</span>);
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-10-3" class="outline-3">
<h3 id="sec-10-3"><span class="section-number-3">10.3</span> 文件上传</h3>
<div class="outline-text-3" id="text-10-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">类型</th>
<th scope="col" class="left">默认值</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>file_uploads</code></td>
<td class="left">是否允许 HTTP 上传文件</td>
<td class="left">int</td>
<td class="left"><code>1</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>upload_tmp_dir</code></td>
<td class="left">存放上传文件的临时文件夹，必须是可写的</td>
<td class="left">string</td>
<td class="left"><code>NULL</code></td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">若为 null 或文件夹不可写，则使用系统默认临时文件夹</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>upload_max_filesize</code></td>
<td class="left">上传文件的最大字节数</td>
<td class="left">int</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>max_file_uploads</code></td>
<td class="left">允许同时上传文件的数量</td>
<td class="left">int</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-10-4" class="outline-3">
<h3 id="sec-10-4"><span class="section-number-3">10.4</span> 路径和目录</h3>
<div class="outline-text-3" id="text-10-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">类型</th>
<th scope="col" class="left">默认值</th>
<th scope="col" class="left">可设定范围</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>include_path</code></td>
<td class="left">用于查找使用相对路径的文件的目录列表，类似 <code>PATH</code> 环境变量</td>
<td class="left">string</td>
<td class="left"><code>.;/path/to/php/pear</code></td>
<td class="left"><code>PHP_INI_ALL</code></td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">用于 <code>require</code> <code>include</code> <code>fopen()</code> <code>file()</code> <code>readfile()</code> <code>file_get_contents()</code></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">可以使用 <code>set_include_path()</code> 进行设定</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-10-5" class="outline-3">
<h3 id="sec-10-5"><span class="section-number-3">10.5</span> 安全模式</h3>
<div class="outline-text-3" id="text-10-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">类型</th>
<th scope="col" class="left">默认值</th>
<th scope="col" class="left">可设定范围</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>safe_mode</code></td>
<td class="left">安全模式，主要影响文件操作</td>
<td class="left">int</td>
<td class="left"><code>0</code></td>
<td class="left"><code>PHP_INI_SYSTEM</code></td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">PHP 会检查当前脚本的拥有者和被操作文件的拥有者是否一致</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">受影响的函数： <code>pathinfo()</code> <code>basename()</code> <code>fopen()</code> <code>exec()</code></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-10-6" class="outline-3">
<h3 id="sec-10-6"><span class="section-number-3">10.6</span> 扩展控制</h3>
<div class="outline-text-3" id="text-10-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">类型</th>
<th scope="col" class="left">默认值</th>
<th scope="col" class="left">可设定范围</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>extension</code></td>
<td class="left">控制扩展的开闭</td>
<td class="left">string</td>
<td class="left"><code>NULL</code></td>
<td class="left"><code>php.ini</code></td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">e.g. <code>extension=php_pdo.dll</code></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>extension_dir</code></td>
<td class="left">动态加载扩展的目录</td>
<td class="left">string</td>
<td class="left"><code>/path/to/php</code></td>
<td class="left"><code>PHP_INI_SYSTEM</code></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> 环境</h2>
<div class="outline-text-2" id="text-11">
</div><div id="outline-container-sec-11-1" class="outline-3">
<h3 id="sec-11-1"><span class="section-number-3">11.1</span> 环境变量</h3>
<div class="outline-text-3" id="text-11-1">
<div class="org-src-container">
<label class="org-src-name">Apache 设置环境变量</label>
<pre class="src src-sh">&lt;VirtualHost ...&gt;
    SetEnv &lt;NAME&gt; <span class="org-string">"&lt;value&gt;"</span>
&lt;/VirtualHost&gt;
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">Nginx 设置环境变量</label>
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">fastcgi_params &#25991;&#20214;</span>
fastcgi_param &lt;NAME&gt; <span class="org-string">'&lt;value&gt;'</span>;

<span class="org-comment-delimiter"># </span><span class="org-comment">nginx.conf &#25991;&#20214;</span>
server {
    include fastcgi_params;
}
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">PHP 读取环境变量</label>
<pre class="src src-php">$<span class="org-variable-name">var</span> = <span class="org-function-name">getenv</span>(<span class="org-string">'NAME'</span>);
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> 高级</h2>
<div class="outline-text-2" id="text-12">
</div><div id="outline-container-sec-12-1" class="outline-3">
<h3 id="sec-12-1"><span class="section-number-3">12.1</span> 命名空间</h3>
<div class="outline-text-3" id="text-12-1">
<p>
PHP 5.3 引入命名空间，通过为一组类、接口、函数、常量加上共同的前缀，避免名称冲突（name collision）。
</p>
</div>
