programming/php/php.org
*** 声明

#+begin_src php
// Symfony/Component/HttpFoundation/Response.php
// 声明必须在文件第一行
namespace Symfony\Component\HttpFoundation;
// 此文件中的类、接口、函数、常量，都属于此命名空间
#+end_src

#+caption: 可以在一个文件中声明多个命名空间，但不是良好习惯。
#+begin_src php
namespace Foo {
}
namespace Bar {
}
#+end_src

*** 引用

#+begin_src php
// 直接引用绝对命名空间，需要 \ 前缀
$response = new \Symfony\Component\HttpFoundation\Response('Oops', 400);

// 直接引用相对命名空间
namespace Symfony\Component;
$response = HttpFoundation\Response('Oops', 400);

// use 引用绝对命名空间，不需要 \ 前缀（use 无法引用相对命名空间）
use Symfony\Component\HttpFoundation\Response; // 隐式别名为 Response
$response = new Response('Oops', 400);

// use 显式别名引用
use Symfony\Component\HttpFoundation\Response as Res;
$response = new Res('Oops', 400);

// use func/constant
use func Namespace\functionName;
use constant Namespace\CONST_NAME;
functionName();
echo CONST_NAME;
#+end_src

- 不指定命名空间时，默认引用属于当前命名空间的类、接口、函数、常量。
- 引用另一个命名空间的代码时，必须使用全称（fully qualified name）。
- =use= 可以在命名空间声明之后，但必须在全局范围内，不能在任何类或函数内。

*** 全局命名空间

没有命名空间的类、接口、函数、常量，属于全局命名空间。

#+caption: 引用全局命名空间的类
#+begin_src php
namespace My\App;
class Foo {
    public function bar() {
        $e = new \Exception(); // 当前代码是在 My\App 命名空间下，如果没有 \ 前缀，
                               // PHP 会试图寻找 My\App\Exception 类
    }
}
#+end_src

#+caption: 引用全局命名空间的函数
#+begin_src php
namespace A\B\C;
function fopen() {  // A\B\C 命名空间下的 fopen()
     $f = \fopen(); // 全局命名空间下的 fopen()
     return $f;
}
#+end_src

*** 规范

PHP 组件和框架通常将其代码放在全局唯一的 vendor 命名空间下。

命名空间不一定映射到文件系统的结构，但为了兼容 PSR-4，大部分 PHP 组件将命名空间映射到文件系统。

** 生成器

- since PHP 5.5.0
- compute and yield iteration values on-demand
- used for iterating large or numerically sequenced data sets using less system memory
- forward-only, impossible to rewind or fast-forward

#+caption: 示例
#+begin_src php
// Generator
function generator() {
    yield 'value1';
    yield 'value2';
    yield 'value3';
    // 无返回值
}
// Invoker
foreach (generator() as $yield) {
    echo $yield, PHP_EOL;
}
#+end_src

Internal process
- when invoking the generator function, PHP returns an object that belongs to the =Generator= class
- during each iteration, PHP asks the =Generator= instance to compute and provide the next iteration value
- the generator pauses its internal state whenever it yields a value
- the generator resumes internal state when it is asked for the next value

*** Compare with standard iterator

Standard iterator
- require implementing the Iterator interface
- iterate in-memory, precomputed data sets
- inefficient with large and formulaic data sets

Standard iterator example
#+begin_src php
<?php
function makeRange($length) {
    $dataset = [];
    for ($i = 0; $i < $length; $i++) {
        $dataset[] = $i;
    }
    return $dataset;
}
$customRange = makeRange(1000000); // allocate 1 million integers into a precomputed array
foreach ($customRange as $i) {
    echo $i, PHP_EOL;
}
#+end_src

Generator example
#+begin_src php
<?php
function makeRange($length) {
    for ($i = 0; $i < $length; $i++) {
        yield $i;
    }
}
foreach (makeRange(1000000) as $i) { // invoke with foreach()
                                     // allocate memory for only 1 integer at any given time
    echo $i, PHP_EOL;
}
#+end_src

