programming/php/php.html

<div id="outline-container-sec-12-1-1" class="outline-4">
<h4 id="sec-12-1-1"><span class="section-number-4">12.1.1</span> 声明</h4>
<div class="outline-text-4" id="text-12-1-1">
<div class="org-src-container">

<pre class="src src-php"><span class="org-comment-delimiter">// </span><span class="org-comment">Symfony/Component/HttpFoundation/Response.php</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">&#22768;&#26126;&#24517;&#39035;&#22312;&#25991;&#20214;&#31532;&#19968;&#34892;</span>
<span class="org-keyword">namespace</span> <span class="org-type">Symfony\Component\HttpFoundation</span>;
<span class="org-comment-delimiter">// </span><span class="org-comment">&#27492;&#25991;&#20214;&#20013;&#30340;&#31867;&#12289;&#25509;&#21475;&#12289;&#20989;&#25968;&#12289;&#24120;&#37327;&#65292;&#37117;&#23646;&#20110;&#27492;&#21629;&#21517;&#31354;&#38388;</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">可以在一个文件中声明多个命名空间，但不是良好习惯。</label>
<pre class="src src-php"><span class="org-keyword">namespace</span> <span class="org-type">Foo</span> {
}
<span class="org-keyword">namespace</span> <span class="org-type">Bar</span> {
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-12-1-2" class="outline-4">
<h4 id="sec-12-1-2"><span class="section-number-4">12.1.2</span> 引用</h4>
<div class="outline-text-4" id="text-12-1-2">
<div class="org-src-container">

<pre class="src src-php"><span class="org-comment-delimiter">// </span><span class="org-comment">&#30452;&#25509;&#24341;&#29992;&#32477;&#23545;&#21629;&#21517;&#31354;&#38388;&#65292;&#38656;&#35201; \ &#21069;&#32512;</span>
$<span class="org-variable-name">response</span> = <span class="org-keyword">new</span> <span class="org-type">\Symfony\Component\HttpFoundation\Response</span>(<span class="org-string">'Oops'</span>, <span class="org-default">400</span>);

<span class="org-comment-delimiter">// </span><span class="org-comment">&#30452;&#25509;&#24341;&#29992;&#30456;&#23545;&#21629;&#21517;&#31354;&#38388;</span>
<span class="org-keyword">namespace</span> <span class="org-type">Symfony\Component</span>;
$<span class="org-variable-name">response</span> = <span class="org-type">HttpFoundation\</span><span class="org-function-name">Response</span>(<span class="org-string">'Oops'</span>, <span class="org-default">400</span>);

<span class="org-comment-delimiter">// </span><span class="org-comment">use &#24341;&#29992;&#32477;&#23545;&#21629;&#21517;&#31354;&#38388;&#65292;&#19981;&#38656;&#35201; \ &#21069;&#32512;&#65288;use &#26080;&#27861;&#24341;&#29992;&#30456;&#23545;&#21629;&#21517;&#31354;&#38388;&#65289;</span>
<span class="org-keyword">use</span> <span class="org-type">Symfony\Component\HttpFoundation\Response</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">&#38544;&#24335;&#21035;&#21517;&#20026; Response</span>
$<span class="org-variable-name">response</span> = <span class="org-keyword">new</span> <span class="org-type">Response</span>(<span class="org-string">'Oops'</span>, <span class="org-default">400</span>);

<span class="org-comment-delimiter">// </span><span class="org-comment">use &#26174;&#24335;&#21035;&#21517;&#24341;&#29992;</span>
<span class="org-keyword">use</span> <span class="org-type">Symfony\Component\HttpFoundation\Response</span> <span class="org-keyword">as</span> <span class="org-function-name">Res</span>;
$<span class="org-variable-name">response</span> = <span class="org-keyword">new</span> <span class="org-type">Res</span>(<span class="org-string">'Oops'</span>, <span class="org-default">400</span>);

<span class="org-comment-delimiter">// </span><span class="org-comment">use func/constant</span>
<span class="org-keyword">use</span> <span class="org-type">func</span> <span class="org-warning">Namespace</span>\<span class="org-warning">functionName</span>;
<span class="org-keyword">use</span> <span class="org-type">constant</span> <span class="org-warning">Namespace</span>\<span class="org-warning">CONST_NAME</span>;
<span class="org-function-name">functionName</span>();
<span class="org-keyword">echo</span> <span class="org-constant">CONST_NAME</span>;
</pre>
</div>

<ul class="org-ul">
<li>不指定命名空间时，默认引用属于当前命名空间的类、接口、函数、常量。
</li>
<li>引用另一个命名空间的代码时，必须使用全称（fully qualified name）。
</li>
<li><code>use</code> 可以在命名空间声明之后，但必须在全局范围内，不能在任何类或函数内。
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-12-1-3" class="outline-4">
<h4 id="sec-12-1-3"><span class="section-number-4">12.1.3</span> 全局命名空间</h4>
<div class="outline-text-4" id="text-12-1-3">
<p>
没有命名空间的类、接口、函数、常量，属于全局命名空间。
</p>

<div class="org-src-container">
<label class="org-src-name">引用全局命名空间的类</label>
<pre class="src src-php"><span class="org-keyword">namespace</span> <span class="org-type">My\App</span>;
<span class="org-keyword">class</span> <span class="org-type">Foo</span> {
    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">bar</span>() {
        $<span class="org-variable-name">e</span> = <span class="org-keyword">new</span> <span class="org-type">\Exception</span>(); <span class="org-comment-delimiter">// </span><span class="org-comment">&#24403;&#21069;&#20195;&#30721;&#26159;&#22312; My\App &#21629;&#21517;&#31354;&#38388;&#19979;&#65292;&#22914;&#26524;&#27809;&#26377; \ &#21069;&#32512;&#65292;</span>
                               <span class="org-comment-delimiter">// </span><span class="org-comment">PHP &#20250;&#35797;&#22270;&#23547;&#25214; My\App\Exception &#31867;</span>
    }
}
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">引用全局命名空间的函数</label>
<pre class="src src-php"><span class="org-keyword">namespace</span> <span class="org-type">A\B\C</span>;
<span class="org-keyword">function</span> <span class="org-function-name">fopen</span>() {  <span class="org-comment-delimiter">// </span><span class="org-comment">A\B\C &#21629;&#21517;&#31354;&#38388;&#19979;&#30340; fopen()</span>
     $<span class="org-variable-name">f</span> = \<span class="org-function-name">fopen</span>(); <span class="org-comment-delimiter">// </span><span class="org-comment">&#20840;&#23616;&#21629;&#21517;&#31354;&#38388;&#19979;&#30340; fopen()</span>
     <span class="org-keyword">return</span> $<span class="org-variable-name">f</span>;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-12-1-4" class="outline-4">
<h4 id="sec-12-1-4"><span class="section-number-4">12.1.4</span> 规范</h4>
<div class="outline-text-4" id="text-12-1-4">
<p>
PHP 组件和框架通常将其代码放在全局唯一的 vendor 命名空间下。
</p>

<p>
命名空间不一定映射到文件系统的结构，但为了兼容 PSR-4，大部分 PHP 组件将命名空间映射到文件系统。
</p>
</div>
</div>
</div>
<div id="outline-container-sec-12-2" class="outline-3">
<h3 id="sec-12-2"><span class="section-number-3">12.2</span> 生成器</h3>
<div class="outline-text-3" id="text-12-2">
<ul class="org-ul">
<li>since PHP 5.5.0
</li>
<li>compute and yield iteration values on-demand
</li>
<li>used for iterating large or numerically sequenced data sets using less system memory
</li>
<li>forward-only, impossible to rewind or fast-forward
</li>
</ul>

<div class="org-src-container">
<label class="org-src-name">示例</label>
<pre class="src src-php"><span class="org-comment-delimiter">// </span><span class="org-comment">Generator</span>
<span class="org-keyword">function</span> <span class="org-function-name">generator</span>() {
    <span class="org-keyword">yield</span> <span class="org-string">'value1'</span>;
    <span class="org-keyword">yield</span> <span class="org-string">'value2'</span>;
    <span class="org-keyword">yield</span> <span class="org-string">'value3'</span>;
    <span class="org-comment-delimiter">// </span><span class="org-comment">&#26080;&#36820;&#22238;&#20540;</span>
}
<span class="org-comment-delimiter">// </span><span class="org-comment">Invoker</span>
<span class="org-keyword">foreach</span> (<span class="org-function-name">generator</span>() <span class="org-keyword">as</span> <span class="org-function-name">$yield</span>) {
    <span class="org-keyword">echo</span> $<span class="org-variable-name">yield</span>, <span class="org-constant">PHP_EOL</span>;
}
</pre>
</div>

<p>
Internal process
</p>
<ul class="org-ul">
<li>when invoking the generator function, PHP returns an object that belongs to the <code>Generator</code> class
</li>
<li>during each iteration, PHP asks the <code>Generator</code> instance to compute and provide the next iteration value
</li>
<li>the generator pauses its internal state whenever it yields a value
</li>
<li>the generator resumes internal state when it is asked for the next value
</li>
</ul>
</div>

<div id="outline-container-sec-12-2-1" class="outline-4">
<h4 id="sec-12-2-1"><span class="section-number-4">12.2.1</span> Compare with standard iterator</h4>
<div class="outline-text-4" id="text-12-2-1">
<p>
Standard iterator
</p>
<ul class="org-ul">
<li>require implementing the Iterator interface
</li>
<li>iterate in-memory, precomputed data sets
</li>
<li>inefficient with large and formulaic data sets
</li>
</ul>

<p>
Standard iterator example
</p>
<div class="org-src-container">

<pre class="src src-php"><span class="org-preprocessor">&lt;?php</span>
<span class="org-keyword">function</span> <span class="org-function-name">makeRange</span>($<span class="org-variable-name">length</span>) {
    $<span class="org-variable-name">dataset</span> = [];
    <span class="org-keyword">for</span> ($<span class="org-variable-name">i</span> = <span class="org-default">0</span>; $<span class="org-variable-name">i</span> &lt; $<span class="org-variable-name">length</span>; $<span class="org-variable-name">i</span>++) {
        $<span class="org-variable-name">dataset</span>[] = $<span class="org-variable-name">i</span>;
    }
    <span class="org-keyword">return</span> $<span class="org-variable-name">dataset</span>;
}
$<span class="org-variable-name">customRange</span> = <span class="org-function-name">makeRange</span>(<span class="org-default">1000000</span>); <span class="org-comment-delimiter">// </span><span class="org-comment">allocate 1 million integers into a precomputed array</span>
<span class="org-keyword">foreach</span> ($<span class="org-variable-name">customRange</span> <span class="org-keyword">as</span> <span class="org-function-name">$i</span>) {
    <span class="org-keyword">echo</span> $<span class="org-variable-name">i</span>, <span class="org-constant">PHP_EOL</span>;
}
</pre>
</div>

<p>
Generator example
</p>
<div class="org-src-container">

<pre class="src src-php"><span class="org-preprocessor">&lt;?php</span>
<span class="org-keyword">function</span> <span class="org-function-name">makeRange</span>($<span class="org-variable-name">length</span>) {
    <span class="org-keyword">for</span> ($<span class="org-variable-name">i</span> = <span class="org-default">0</span>; $<span class="org-variable-name">i</span> &lt; $<span class="org-variable-name">length</span>; $<span class="org-variable-name">i</span>++) {
        <span class="org-keyword">yield</span> $<span class="org-variable-name">i</span>;
    }
}
<span class="org-keyword">foreach</span> (<span class="org-function-name">makeRange</span>(<span class="org-default">1000000</span>) <span class="org-keyword">as</span> <span class="org-function-name">$i</span>) { <span class="org-comment-delimiter">// </span><span class="org-comment">invoke with foreach()</span>
                                     <span class="org-comment-delimiter">// </span><span class="org-comment">allocate memory for only 1 integer at any given time</span>
    <span class="org-keyword">echo</span> $<span class="org-variable-name">i</span>, <span class="org-constant">PHP_EOL</span>;
}
</pre>
</div>
</div>
</div>
