programming/php/php.org
*** CSV generator example

#+begin_src php
<?php
function getRows($file) {
    $handle = fopen($file, 'rb');
    if ($handle === false) {
        throw new Exception();
    }
    while (feof($handle) === false) {
        yield fgetcsv($handle);
    }
    fclose($handle);
}
foreach (getRows('data.csv') as $row) { // allocate memory for one row at a time
                                        // instead of reading the entire file into memory
    print_r($row);
}
#+end_src

* 框架

#+attr_html: :class no-border
| *CakePHP*     | 受 RoR 启发，坚持至简的原则（Keep It Simple Stupid） |
|               | 优点：社区活跃，比 Zend 和 Symfony 简单              |
|               | 缺点：编程方式有一些特殊要求                         |
|---------------+------------------------------------------------------|
| *CodeIgniter* | 优点：运行速度快，轻量，开发迅速，社区活跃，文档完整 |
|               | 缺点：编程方式太自由                                 |
|---------------+------------------------------------------------------|
| *Laravel*     |                                                      |
|---------------+------------------------------------------------------|
| *Phalcon*     |                                                      |
|---------------+------------------------------------------------------|
| *Slim*        |                                                      |
|---------------+------------------------------------------------------|
| *Symfony*     | 优点：使用 ORM，有专属的模板引擎 Twig，社区活跃      |
|               | 缺点：学习曲线陡                                     |
|---------------+------------------------------------------------------|
| *Yii*         | 优点：运行速度快，特性丰富                           |
|---------------+------------------------------------------------------|
| *Zend*        | 优点：企业级应用，Lucene 搜索特性                    |
|               | 缺点：设计模式难以理解                               |

* 命令
** =php=

#+begin_src sh
php <options> <file>

    -a                # 交互 shell
    -e                # 扩展信息模式，用做 debugger、profiler

    -c <path>|<file>  # 设定查找 php.ini 的目录，或自定义 .ini 文件
    -n                # 完全忽略 php.ini
    --ini             # 输出配置文件目录和路径 

    -d <direc>[=<value>] # 设置指令
        <direc>          # 设为 1
        <direc>=         # 设为 ""
        <direc>=<value>  # 设为指定值

    -f <file>         # 解析、执行指定文件，可省略 -f
    -r <code>         # 执行代码
    -B <code>         # 处理输入行之前执行代码
    -r <code>         # 处理每行输入都执行代码
    -E <code>         # 处理输入行之后执行代码

    -i                # phpinfo()
    -m                # 输出已加载的 PHP 和 Zend 模块
    -v                # 输出 SAPI 名、PHP 和 Zend 版本

    -S <addr>:<port>  # 启动内置 web server（PHP 5.4）
    -t <path>         # 为内置 web server 设定根目录

    -l                # 检查 PHP 语法
    -s                # 生成语法高亮的 HTML 代码（<code>...</code>）
    -w                # 去除代码中的注释和空白字符

    -z <file>         # 加载 Zend 扩展

    --rf <name>       # 输出函数、类方法的信息（参数个数、名称）
    --rc <name>       # 输出类的信息（常量、成员、方法）
    --re <name>       # 输出扩展的信息（php.ini 设置项、函数、常量、类）
    --rz <name>       # 输出 Zend 扩展的信息（php.ini 设置项、函数、常量、类）
    --ri <name>       # 输出扩展的配置信息
#+end_src

*** 参数

#+begin_src sh
php <file> arg1 arg2 ...
#+end_src

传递给脚本的第一个参数是脚本文件名，所以 =$argc= 至少为 1， =$argv[0]= 为脚本文件名。

*** 执行代码

#+begin_src sh
php -r "$foo = get_defined_constants();"                 # 报错，shell 会试图替换 $foo
php -r '$foo = get_defined_constants(); var_dump($foo);' # 使用单引号避免 shell 变量替换
#+end_src

*** 内置服务器

#+caption: 示例
#+begin_src sh
$ php -S localhost:4000
$ php -S 0.0.0.0:4000                         # 监听所有端口
$ php -S localhost:8000 -c app/config/php.ini # 指定配置文件
#+end_src

- current working directory is the web server's document root be default
- each HTTP request is logged to standard out in terminal
- doesn't support .htaccess files, must use router script for front controllers

