programming/php/php.html
<div id="outline-container-sec-12-2-2" class="outline-4">
<h4 id="sec-12-2-2"><span class="section-number-4">12.2.2</span> CSV generator example</h4>
<div class="outline-text-4" id="text-12-2-2">
<div class="org-src-container">

<pre class="src src-php"><span class="org-preprocessor">&lt;?php</span>
<span class="org-keyword">function</span> <span class="org-function-name">getRows</span>($<span class="org-variable-name">file</span>) {
    $<span class="org-variable-name">handle</span> = <span class="org-function-name">fopen</span>($<span class="org-variable-name">file</span>, <span class="org-string">'rb'</span>);
    <span class="org-keyword">if</span> ($<span class="org-variable-name">handle</span> === <span class="org-constant">false</span>) {
        <span class="org-keyword">throw</span> <span class="org-keyword">new</span> <span class="org-type">Exception</span>();
    }
    <span class="org-keyword">while</span> (<span class="org-function-name">feof</span>($<span class="org-variable-name">handle</span>) === <span class="org-constant">false</span>) {
        <span class="org-keyword">yield</span> <span class="org-function-name">fgetcsv</span>($<span class="org-variable-name">handle</span>);
    }
    <span class="org-function-name">fclose</span>($<span class="org-variable-name">handle</span>);
}
<span class="org-keyword">foreach</span> (<span class="org-function-name">getRows</span>(<span class="org-string">'data.csv'</span>) <span class="org-keyword">as</span> <span class="org-function-name">$row</span>) { <span class="org-comment-delimiter">// </span><span class="org-comment">allocate memory for one row at a time</span>
                                        <span class="org-comment-delimiter">// </span><span class="org-comment">instead of reading the entire file into memory</span>
    <span class="org-function-name">print_r</span>($<span class="org-variable-name">row</span>);
}
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> 框架</h2>
<div class="outline-text-2" id="text-13">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" class="no-border">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><b>CakePHP</b></th>
<th scope="col" class="left">受 RoR 启发，坚持至简的原则（Keep It Simple Stupid）</th>
</tr>

<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">优点：社区活跃，比 Zend 和 Symfony 简单</th>
</tr>

<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">缺点：编程方式有一些特殊要求</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><b>CodeIgniter</b></td>
<td class="left">优点：运行速度快，轻量，开发迅速，社区活跃，文档完整</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">缺点：编程方式太自由</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><b>Laravel</b></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><b>Phalcon</b></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><b>Slim</b></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><b>Symfony</b></td>
<td class="left">优点：使用 ORM，有专属的模板引擎 Twig，社区活跃</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">缺点：学习曲线陡</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><b>Yii</b></td>
<td class="left">优点：运行速度快，特性丰富</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><b>Zend</b></td>
<td class="left">优点：企业级应用，Lucene 搜索特性</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">缺点：设计模式难以理解</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> 命令</h2>
<div class="outline-text-2" id="text-14">
</div><div id="outline-container-sec-14-1" class="outline-3">
<h3 id="sec-14-1"><span class="section-number-3">14.1</span> <code>php</code></h3>
<div class="outline-text-3" id="text-14-1">
<div class="org-src-container">

<pre class="src src-sh">php &lt;options&gt; &lt;file&gt;

    -a                <span class="org-comment-delimiter"># </span><span class="org-comment">&#20132;&#20114; shell</span>
    -e                <span class="org-comment-delimiter"># </span><span class="org-comment">&#25193;&#23637;&#20449;&#24687;&#27169;&#24335;&#65292;&#29992;&#20570; debugger&#12289;profiler</span>

    -c &lt;path&gt;|&lt;file&gt;  <span class="org-comment-delimiter"># </span><span class="org-comment">&#35774;&#23450;&#26597;&#25214; php.ini &#30340;&#30446;&#24405;&#65292;&#25110;&#33258;&#23450;&#20041; .ini &#25991;&#20214;</span>
    -n                <span class="org-comment-delimiter"># </span><span class="org-comment">&#23436;&#20840;&#24573;&#30053; php.ini</span>
    --ini             <span class="org-comment-delimiter"># </span><span class="org-comment">&#36755;&#20986;&#37197;&#32622;&#25991;&#20214;&#30446;&#24405;&#21644;&#36335;&#24452; </span>

    -d &lt;direc&gt;[=&lt;value&gt;] <span class="org-comment-delimiter"># </span><span class="org-comment">&#35774;&#32622;&#25351;&#20196;</span>
        &lt;direc&gt;          <span class="org-comment-delimiter"># </span><span class="org-comment">&#35774;&#20026; 1</span>
        &lt;direc&gt;=         <span class="org-comment-delimiter"># </span><span class="org-comment">&#35774;&#20026; ""</span>
        &lt;direc&gt;=&lt;value&gt;  <span class="org-comment-delimiter"># </span><span class="org-comment">&#35774;&#20026;&#25351;&#23450;&#20540;</span>

    -f &lt;file&gt;         <span class="org-comment-delimiter"># </span><span class="org-comment">&#35299;&#26512;&#12289;&#25191;&#34892;&#25351;&#23450;&#25991;&#20214;&#65292;&#21487;&#30465;&#30053; -f</span>
    -r &lt;code&gt;         <span class="org-comment-delimiter"># </span><span class="org-comment">&#25191;&#34892;&#20195;&#30721;</span>
    -B &lt;code&gt;         <span class="org-comment-delimiter"># </span><span class="org-comment">&#22788;&#29702;&#36755;&#20837;&#34892;&#20043;&#21069;&#25191;&#34892;&#20195;&#30721;</span>
    -r &lt;code&gt;         <span class="org-comment-delimiter"># </span><span class="org-comment">&#22788;&#29702;&#27599;&#34892;&#36755;&#20837;&#37117;&#25191;&#34892;&#20195;&#30721;</span>
    -E &lt;code&gt;         <span class="org-comment-delimiter"># </span><span class="org-comment">&#22788;&#29702;&#36755;&#20837;&#34892;&#20043;&#21518;&#25191;&#34892;&#20195;&#30721;</span>

    -i                <span class="org-comment-delimiter"># </span><span class="org-comment">phpinfo()</span>
    -m                <span class="org-comment-delimiter"># </span><span class="org-comment">&#36755;&#20986;&#24050;&#21152;&#36733;&#30340; PHP &#21644; Zend &#27169;&#22359;</span>
    -v                <span class="org-comment-delimiter"># </span><span class="org-comment">&#36755;&#20986; SAPI &#21517;&#12289;PHP &#21644; Zend &#29256;&#26412;</span>

    -S &lt;addr&gt;:&lt;port&gt;  <span class="org-comment-delimiter"># </span><span class="org-comment">&#21551;&#21160;&#20869;&#32622; web server&#65288;PHP 5.4&#65289;</span>
    -t &lt;path&gt;         <span class="org-comment-delimiter"># </span><span class="org-comment">&#20026;&#20869;&#32622; web server &#35774;&#23450;&#26681;&#30446;&#24405;</span>

    -l                <span class="org-comment-delimiter"># </span><span class="org-comment">&#26816;&#26597; PHP &#35821;&#27861;</span>
    -s                <span class="org-comment-delimiter"># </span><span class="org-comment">&#29983;&#25104;&#35821;&#27861;&#39640;&#20142;&#30340; HTML &#20195;&#30721;&#65288;&lt;code&gt;...&lt;/code&gt;&#65289;</span>
    -w                <span class="org-comment-delimiter"># </span><span class="org-comment">&#21435;&#38500;&#20195;&#30721;&#20013;&#30340;&#27880;&#37322;&#21644;&#31354;&#30333;&#23383;&#31526;</span>

    -z &lt;file&gt;         <span class="org-comment-delimiter"># </span><span class="org-comment">&#21152;&#36733; Zend &#25193;&#23637;</span>

    --rf &lt;name&gt;       <span class="org-comment-delimiter"># </span><span class="org-comment">&#36755;&#20986;&#20989;&#25968;&#12289;&#31867;&#26041;&#27861;&#30340;&#20449;&#24687;&#65288;&#21442;&#25968;&#20010;&#25968;&#12289;&#21517;&#31216;&#65289;</span>
    --rc &lt;name&gt;       <span class="org-comment-delimiter"># </span><span class="org-comment">&#36755;&#20986;&#31867;&#30340;&#20449;&#24687;&#65288;&#24120;&#37327;&#12289;&#25104;&#21592;&#12289;&#26041;&#27861;&#65289;</span>
    --re &lt;name&gt;       <span class="org-comment-delimiter"># </span><span class="org-comment">&#36755;&#20986;&#25193;&#23637;&#30340;&#20449;&#24687;&#65288;php.ini &#35774;&#32622;&#39033;&#12289;&#20989;&#25968;&#12289;&#24120;&#37327;&#12289;&#31867;&#65289;</span>
    --rz &lt;name&gt;       <span class="org-comment-delimiter"># </span><span class="org-comment">&#36755;&#20986; Zend &#25193;&#23637;&#30340;&#20449;&#24687;&#65288;php.ini &#35774;&#32622;&#39033;&#12289;&#20989;&#25968;&#12289;&#24120;&#37327;&#12289;&#31867;&#65289;</span>
    --ri &lt;name&gt;       <span class="org-comment-delimiter"># </span><span class="org-comment">&#36755;&#20986;&#25193;&#23637;&#30340;&#37197;&#32622;&#20449;&#24687;</span>
</pre>
</div>
</div>

<div id="outline-container-sec-14-1-1" class="outline-4">
<h4 id="sec-14-1-1"><span class="section-number-4">14.1.1</span> 参数</h4>
<div class="outline-text-4" id="text-14-1-1">
<div class="org-src-container">

<pre class="src src-sh">php &lt;file&gt; arg1 arg2 ...
</pre>
</div>

<p>
传递给脚本的第一个参数是脚本文件名，所以 <code>$argc</code> 至少为 1， <code>$argv[0]</code> 为脚本文件名。
</p>
</div>
</div>
<div id="outline-container-sec-14-1-2" class="outline-4">
<h4 id="sec-14-1-2"><span class="section-number-4">14.1.2</span> 执行代码</h4>
<div class="outline-text-4" id="text-14-1-2">
<div class="org-src-container">

<pre class="src src-sh">php -r <span class="org-string">"$foo = get_defined_constants();"</span>                 <span class="org-comment-delimiter"># </span><span class="org-comment">&#25253;&#38169;&#65292;shell &#20250;&#35797;&#22270;&#26367;&#25442; $foo</span>
php -r <span class="org-string">'$foo = get_defined_constants(); var_dump($foo);'</span> <span class="org-comment-delimiter"># </span><span class="org-comment">&#20351;&#29992;&#21333;&#24341;&#21495;&#36991;&#20813; shell &#21464;&#37327;&#26367;&#25442;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-14-1-3" class="outline-4">
<h4 id="sec-14-1-3"><span class="section-number-4">14.1.3</span> 内置服务器</h4>
<div class="outline-text-4" id="text-14-1-3">
<div class="org-src-container">
<label class="org-src-name">示例</label>
<pre class="src src-sh">$ php -S localhost:4000
$ php -S 0.0.0.0:4000                         <span class="org-comment-delimiter"># </span><span class="org-comment">&#30417;&#21548;&#25152;&#26377;&#31471;&#21475;</span>
$ php -S localhost:8000 -c app/config/php.ini <span class="org-comment-delimiter"># </span><span class="org-comment">&#25351;&#23450;&#37197;&#32622;&#25991;&#20214;</span>
</pre>
</div>

<ul class="org-ul">
<li>current working directory is the web server's document root be default
</li>
<li>each HTTP request is logged to standard out in terminal
</li>
<li>doesn't support .htaccess files, must use router script for front controllers
</li>
</ul>
</div>
</div>
