programming/php/php.org
*** Router script

- executed before every HTTP request
- if returns false, the static asset referenced by the HTTP request URI is returned
- otherwise the output of the router script is returned as the HTTP response body
- can be used to hardcode the functionality as an .htaccess file for front controllers

#+begin_src sh
php -S localhost:8000 router.php
#+end_src

*** CGI

| =-b= =--bindpath=  |   |
|--------------------+---|
| =-C= =--no-chdir=  |   |
|--------------------+---|
| =-q= =--no-header= |   |
|--------------------+---|
| =-T= =--timing=    |   |

*** 进程

| =-B= =--process-begin= |   |
|------------------------+---|
| =-R= =--process-code=  |   |
|------------------------+---|
| =-F= =--process-file=  |   |
|------------------------+---|
| =-E= =--process-end=   |   |

** =phpenmod= =phpdismod=

#+begin_src sh
phpenmod <extension>
phpdismod <extension>
#+end_src

* 链接

1. [[http://cn2.php.net/manual/en/][PHP Manual]]
1. [[https://github.com/php/php-langspec][PHP Language Specifications]]
1. [[http://php.net/manual/en/ini.list.php][List of php.ini directives]]
