programming/php/php.html
<div id="outline-container-sec-14-1-4" class="outline-4">
<h4 id="sec-14-1-4"><span class="section-number-4">14.1.4</span> Router script</h4>
<div class="outline-text-4" id="text-14-1-4">
<ul class="org-ul">
<li>executed before every HTTP request
</li>
<li>if returns false, the static asset referenced by the HTTP request URI is returned
</li>
<li>otherwise the output of the router script is returned as the HTTP response body
</li>
<li>can be used to hardcode the functionality as an .htaccess file for front controllers
</li>
</ul>

<div class="org-src-container">

<pre class="src src-sh">php -S localhost:8000 router.php
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-14-1-5" class="outline-4">
<h4 id="sec-14-1-5"><span class="section-number-4">14.1.5</span> CGI</h4>
<div class="outline-text-4" id="text-14-1-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><code>-b</code> <code>--bindpath</code></th>
<th scope="col" class="left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>-C</code> <code>--no-chdir</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>-q</code> <code>--no-header</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>-T</code> <code>--timing</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-14-1-6" class="outline-4">
<h4 id="sec-14-1-6"><span class="section-number-4">14.1.6</span> 进程</h4>
<div class="outline-text-4" id="text-14-1-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><code>-B</code> <code>--process-begin</code></th>
<th scope="col" class="left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>-R</code> <code>--process-code</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>-F</code> <code>--process-file</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>-E</code> <code>--process-end</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-sec-14-2" class="outline-3">
<h3 id="sec-14-2"><span class="section-number-3">14.2</span> <code>phpenmod</code> <code>phpdismod</code></h3>
<div class="outline-text-3" id="text-14-2">
<div class="org-src-container">

<pre class="src src-sh">phpenmod &lt;extension&gt;
phpdismod &lt;extension&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> 链接</h2>
<div class="outline-text-2" id="text-15">
<ol class="org-ol">
<li><a href="http://cn2.php.net/manual/en/">PHP Manual</a>
</li>
<li><a href="https://github.com/php/php-langspec">PHP Language Specifications</a>
</li>
<li><a href="http://php.net/manual/en/ini.list.php">List of php.ini directives</a>
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-09-15 Fri 21:18</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5h)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
